<?php

/**
 * 省市区数据
 * @package dict
 * @author goodzsq@gmail.com
 */
class dict_province extends dict_base {

    public function loadData() {
        return array(
            0 =>
            array(
                'name' => '北京市',
                'order' => '1',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '北京市',
                        'order' => '1',
                        'child' =>
                        array(
                            1 => '东城区',
                            2 => '西城区',
                            3 => '崇文区',
                            4 => '宣武区',
                            5 => '朝阳区',
                            6 => '丰台区',
                            7 => '石景山区',
                            8 => '海淀区',
                            9 => '门头沟区',
                            10 => '房山区',
                            11 => '通州区',
                            12 => '顺义区',
                            13 => '昌平区',
                            14 => '大兴区',
                            15 => '怀柔区',
                            16 => '平谷区',
                            17 => '密云县',
                            18 => '延庆县',
                        ),
                    ),
                ),
            ),
            1 =>
            array(
                'name' => '天津市',
                'order' => '2',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '天津市',
                        'order' => '2',
                        'child' =>
                        array(
                            19 => '和平区',
                            20 => '河东区',
                            21 => '河西区',
                            22 => '南开区',
                            23 => '河北区',
                            24 => '红桥区',
                            25 => '塘沽区',
                            26 => '汉沽区',
                            27 => '大港区',
                            28 => '东丽区',
                            29 => '西青区',
                            30 => '津南区',
                            31 => '北辰区',
                            32 => '武清区',
                            33 => '宝坻区',
                            34 => '宁河县',
                            35 => '静海县',
                            36 => '蓟县',
                        ),
                    ),
                ),
            ),
            2 =>
            array(
                'name' => '河北省',
                'order' => '5',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '邯郸市',
                        'order' => '5',
                        'child' =>
                        array(
                            96 => '邯山区',
                            97 => '丛台区',
                            98 => '复兴区',
                            99 => '峰峰矿区',
                            100 => '邯郸县',
                            101 => '临漳县',
                            102 => '成安县',
                            103 => '大名县',
                            104 => '涉县',
                            105 => '磁县',
                            106 => '肥乡县',
                            107 => '永年县',
                            108 => '邱县',
                            109 => '鸡泽县',
                            110 => '广平县',
                            111 => '馆陶县',
                            112 => '魏县',
                            113 => '曲周县',
                            114 => '武安市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '石家庄市',
                        'order' => '6',
                        'child' =>
                        array(
                            115 => '长安区',
                            116 => '桥东区',
                            117 => '桥西区',
                            118 => '新华区',
                            119 => '井陉矿区',
                            120 => '裕华区',
                            121 => '井陉县',
                            122 => '正定县',
                            123 => '栾城县',
                            124 => '行唐县',
                            125 => '灵寿县',
                            126 => '高邑县',
                            127 => '深泽县',
                            128 => '赞皇县',
                            129 => '无极县',
                            130 => '平山县',
                            131 => '元氏县',
                            132 => '赵县',
                            133 => '辛集市',
                            134 => '藁城市',
                            135 => '晋州市',
                            136 => '新乐市',
                            137 => '鹿泉市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '保定市',
                        'order' => '7',
                        'child' =>
                        array(
                            138 => '新市区',
                            139 => '北市区',
                            140 => '南市区',
                            141 => '满城县',
                            142 => '清苑县',
                            143 => '涞水县',
                            144 => '阜平县',
                            145 => '徐水县',
                            146 => '定兴县',
                            147 => '唐县',
                            148 => '高阳县',
                            149 => '容城县',
                            150 => '涞源县',
                            151 => '望都县',
                            152 => '安新县',
                            153 => '易县',
                            154 => '曲阳县',
                            155 => '蠡县',
                            156 => '顺平县',
                            157 => '博野县',
                            158 => '雄县',
                            159 => '涿州市',
                            160 => '定州市',
                            161 => '安国市',
                            162 => '高碑店市',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '张家口市',
                        'order' => '8',
                        'child' =>
                        array(
                            163 => '桥东区',
                            164 => '桥西区',
                            165 => '宣化区',
                            166 => '下花园区',
                            167 => '宣化县',
                            168 => '张北县',
                            169 => '康保县',
                            170 => '沽源县',
                            171 => '尚义县',
                            172 => '蔚县',
                            173 => '阳原县',
                            174 => '怀安县',
                            175 => '万全县',
                            176 => '怀来县',
                            177 => '涿鹿县',
                            178 => '赤城县',
                            179 => '崇礼县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '承德市',
                        'order' => '9',
                        'child' =>
                        array(
                            180 => '双桥区',
                            181 => '双滦区',
                            182 => '鹰手营子矿区',
                            183 => '承德县',
                            184 => '兴隆县',
                            185 => '平泉县',
                            186 => '滦平县',
                            187 => '隆化县',
                            188 => '丰宁满族自治县',
                            189 => '宽城满族自治县',
                            190 => '围场满族蒙古族自治县',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '唐山市',
                        'order' => '10',
                        'child' =>
                        array(
                            191 => '路南区',
                            192 => '路北区',
                            193 => '古冶区',
                            194 => '开平区',
                            195 => '丰南区',
                            196 => '丰润区',
                            197 => '滦县',
                            198 => '滦南县',
                            199 => '乐亭县',
                            200 => '迁西县',
                            201 => '玉田县',
                            202 => '唐海县',
                            203 => '遵化市',
                            204 => '迁安市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '廊坊市',
                        'order' => '11',
                        'child' =>
                        array(
                            205 => '安次区',
                            206 => '广阳区',
                            207 => '固安县',
                            208 => '永清县',
                            209 => '香河县',
                            210 => '大城县',
                            211 => '文安县',
                            212 => '大厂回族自治县',
                            213 => '霸州市',
                            214 => '三河市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '沧州市',
                        'order' => '12',
                        'child' =>
                        array(
                            215 => '新华区',
                            216 => '运河区',
                            217 => '沧县',
                            218 => '青县',
                            219 => '东光县',
                            220 => '海兴县',
                            221 => '盐山县',
                            222 => '肃宁县',
                            223 => '南皮县',
                            224 => '吴桥县',
                            225 => '献县',
                            226 => '孟村回族自治县',
                            227 => '泊头市',
                            228 => '任丘市',
                            229 => '黄骅市',
                            230 => '河间市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '衡水市',
                        'order' => '13',
                        'child' =>
                        array(
                            231 => '桃城区',
                            232 => '枣强县',
                            233 => '武邑县',
                            234 => '武强县',
                            235 => '饶阳县',
                            236 => '安平县',
                            237 => '故城县',
                            238 => '景县',
                            239 => '阜城县',
                            240 => '冀州市',
                            241 => '深州市',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '邢台市',
                        'order' => '14',
                        'child' =>
                        array(
                            242 => '桥东区',
                            243 => '桥西区',
                            244 => '邢台县',
                            245 => '临城县',
                            246 => '内丘县',
                            247 => '柏乡县',
                            248 => '隆尧县',
                            249 => '任县',
                            250 => '南和县',
                            251 => '宁晋县',
                            252 => '巨鹿县',
                            253 => '新河县',
                            254 => '广宗县',
                            255 => '平乡县',
                            256 => '威县',
                            257 => '清河县',
                            258 => '临西县',
                            259 => '南宫市',
                            260 => '沙河市',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '秦皇岛市',
                        'order' => '15',
                        'child' =>
                        array(
                            261 => '海港区',
                            262 => '山海关区',
                            263 => '北戴河区',
                            264 => '青龙满族自治县',
                            265 => '昌黎县',
                            266 => '抚宁县',
                            267 => '卢龙县',
                        ),
                    ),
                ),
            ),
            3 =>
            array(
                'name' => '山西省',
                'order' => '6',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '朔州市',
                        'order' => '16',
                        'child' =>
                        array(
                            268 => '朔城区',
                            269 => '平鲁区',
                            270 => '山阴县',
                            271 => '应县',
                            272 => '右玉县',
                            273 => '怀仁县',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '忻州市',
                        'order' => '17',
                        'child' =>
                        array(
                            274 => '忻府区',
                            275 => '定襄县',
                            276 => '五台县',
                            277 => '代县',
                            278 => '繁峙县',
                            279 => '宁武县',
                            280 => '静乐县',
                            281 => '神池县',
                            282 => '五寨县',
                            283 => '岢岚县',
                            284 => '河曲县',
                            285 => '保德县',
                            286 => '偏关县',
                            287 => '原平市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '太原市',
                        'order' => '18',
                        'child' =>
                        array(
                            288 => '小店区',
                            289 => '迎泽区',
                            290 => '杏花岭区',
                            291 => '尖草坪区',
                            292 => '万柏林区',
                            293 => '晋源区',
                            294 => '清徐县',
                            295 => '阳曲县',
                            296 => '娄烦县',
                            297 => '古交市',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '大同市',
                        'order' => '19',
                        'child' =>
                        array(
                            298 => '矿区',
                            299 => '南郊区',
                            300 => '新荣区',
                            301 => '阳高县',
                            302 => '天镇县',
                            303 => '广灵县',
                            304 => '灵丘县',
                            305 => '浑源县',
                            306 => '左云县',
                            307 => '大同县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '阳泉市',
                        'order' => '20',
                        'child' =>
                        array(
                            308 => '矿区',
                            309 => '平定县',
                            310 => '盂县',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '晋中市',
                        'order' => '21',
                        'child' =>
                        array(
                            311 => '榆次区',
                            312 => '榆社县',
                            313 => '左权县',
                            314 => '和顺县',
                            315 => '昔阳县',
                            316 => '寿阳县',
                            317 => '太谷县',
                            318 => '祁县',
                            319 => '平遥县',
                            320 => '灵石县',
                            321 => '介休市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '长治市',
                        'order' => '22',
                        'child' =>
                        array(
                            322 => '长治县',
                            323 => '襄垣县',
                            324 => '屯留县',
                            325 => '平顺县',
                            326 => '黎城县',
                            327 => '壶关县',
                            328 => '长子县',
                            329 => '武乡县',
                            330 => '沁县',
                            331 => '沁源县',
                            332 => '潞城市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '晋城市',
                        'order' => '23',
                        'child' =>
                        array(
                            333 => '沁水县',
                            334 => '阳城县',
                            335 => '陵川县',
                            336 => '泽州县',
                            337 => '高平市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '临汾市',
                        'order' => '24',
                        'child' =>
                        array(
                            338 => '尧都区',
                            339 => '曲沃县',
                            340 => '翼城县',
                            341 => '襄汾县',
                            342 => '洪洞县',
                            343 => '古县',
                            344 => '安泽县',
                            345 => '浮山县',
                            346 => '吉县',
                            347 => '乡宁县',
                            348 => '大宁县',
                            349 => '隰县',
                            350 => '永和县',
                            351 => '蒲县',
                            352 => '汾西县',
                            353 => '侯马市',
                            354 => '霍州市',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '吕梁市',
                        'order' => '25',
                        'child' =>
                        array(
                            355 => '离石区',
                            356 => '文水县',
                            357 => '交城县',
                            358 => '兴县',
                            359 => '临县',
                            360 => '柳林县',
                            361 => '石楼县',
                            362 => '岚县',
                            363 => '方山县',
                            364 => '中阳县',
                            365 => '交口县',
                            366 => '孝义市',
                            367 => '汾阳市',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '运城市',
                        'order' => '26',
                        'child' =>
                        array(
                            368 => '盐湖区',
                            369 => '临猗县',
                            370 => '万荣县',
                            371 => '闻喜县',
                            372 => '稷山县',
                            373 => '新绛县',
                            374 => '绛县',
                            375 => '垣曲县',
                            376 => '夏县',
                            377 => '平陆县',
                            378 => '芮城县',
                            379 => '永济市',
                            380 => '河津市',
                        ),
                    ),
                ),
            ),
            4 =>
            array(
                'name' => '内蒙古自治区',
                'order' => '32',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '呼伦贝尔市',
                        'order' => '351',
                        'child' =>
                        array(
                            2724 => '海拉尔区',
                            2725 => '阿荣旗',
                            2726 => '莫力达瓦达斡尔族自治旗',
                            2727 => '鄂伦春自治旗',
                            2728 => '鄂温克族自治旗',
                            2729 => '陈巴尔虎旗',
                            2730 => '新巴尔虎左旗',
                            2731 => '新巴尔虎右旗',
                            2732 => '满洲里市',
                            2733 => '牙克石市',
                            2734 => '扎兰屯市',
                            2735 => '额尔古纳市',
                            2736 => '根河市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '呼和浩特市',
                        'order' => '352',
                        'child' =>
                        array(
                            2737 => '新城区',
                            2738 => '回民区',
                            2739 => '玉泉区',
                            2740 => '赛罕区',
                            2741 => '土默特左旗',
                            2742 => '托克托县',
                            2743 => '和林格尔县',
                            2744 => '清水河县',
                            2745 => '武川县',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '包头市',
                        'order' => '353',
                        'child' =>
                        array(
                            2746 => '东河区',
                            2747 => '昆都仑区',
                            2748 => '青山区',
                            2749 => '石拐区',
                            2750 => '白云鄂博矿区',
                            2751 => '九原区',
                            2752 => '土默特右旗',
                            2753 => '固阳县',
                            2754 => '达尔罕茂明安联合旗',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '乌海市',
                        'order' => '354',
                        'child' =>
                        array(
                            2755 => '海勃湾区',
                            2756 => '海南区',
                            2757 => '乌达区',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '乌兰察布市',
                        'order' => '355',
                        'child' =>
                        array(
                            2758 => '集宁区',
                            2759 => '卓资县',
                            2760 => '化德县',
                            2761 => '商都县',
                            2762 => '兴和县',
                            2763 => '凉城县',
                            2764 => '察哈尔右翼前旗',
                            2765 => '察哈尔右翼中旗',
                            2766 => '察哈尔右翼后旗',
                            2767 => '四子王旗',
                            2768 => '丰镇市',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '通辽市',
                        'order' => '356',
                        'child' =>
                        array(
                            2769 => '科尔沁区',
                            2770 => '科尔沁左翼中旗',
                            2771 => '科尔沁左翼后旗',
                            2772 => '开鲁县',
                            2773 => '库伦旗',
                            2774 => '奈曼旗',
                            2775 => '扎鲁特旗',
                            2776 => '霍林郭勒市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '赤峰市',
                        'order' => '357',
                        'child' =>
                        array(
                            2777 => '红山区',
                            2778 => '元宝山区',
                            2779 => '松山区',
                            2780 => '阿鲁科尔沁旗',
                            2781 => '巴林左旗',
                            2782 => '巴林右旗',
                            2783 => '林西县',
                            2784 => '克什克腾旗',
                            2785 => '翁牛特旗',
                            2786 => '喀喇沁旗',
                            2787 => '宁城县',
                            2788 => '敖汉旗',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '鄂尔多斯市',
                        'order' => '358',
                        'child' =>
                        array(
                            2789 => '东胜区',
                            2790 => '达拉特旗',
                            2791 => '准格尔旗',
                            2792 => '鄂托克前旗',
                            2793 => '鄂托克旗',
                            2794 => '杭锦旗',
                            2795 => '乌审旗',
                            2796 => '伊金霍洛旗',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '巴彦淖尔市',
                        'order' => '359',
                        'child' =>
                        array(
                            2797 => '临河区',
                            2798 => '五原县',
                            2799 => '磴口县',
                            2800 => '乌拉特前旗',
                            2801 => '乌拉特中旗',
                            2802 => '乌拉特后旗',
                            2803 => '杭锦后旗',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '锡林郭勒盟',
                        'order' => '360',
                        'child' =>
                        array(
                            2804 => '二连浩特市',
                            2805 => '锡林浩特市',
                            2806 => '阿巴嘎旗',
                            2807 => '苏尼特左旗',
                            2808 => '苏尼特右旗',
                            2809 => '东乌珠穆沁旗',
                            2810 => '西乌珠穆沁旗',
                            2811 => '太仆寺旗',
                            2812 => '镶黄旗',
                            2813 => '正镶白旗',
                            2814 => '正蓝旗',
                            2815 => '多伦县',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '兴安盟',
                        'order' => '361',
                        'child' =>
                        array(
                            2816 => '乌兰浩特市',
                            2817 => '阿尔山市',
                            2818 => '科尔沁右翼前旗',
                            2819 => '科尔沁右翼中旗',
                            2820 => '扎赉特旗',
                            2821 => '突泉县',
                        ),
                    ),
                    11 =>
                    array(
                        'name' => '阿拉善盟',
                        'order' => '362',
                        'child' =>
                        array(
                            2822 => '阿拉善左旗',
                            2823 => '阿拉善右旗',
                            2824 => '额济纳旗',
                        ),
                    ),
                ),
            ),
            5 =>
            array(
                'name' => '辽宁省',
                'order' => '8',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '沈阳市',
                        'order' => '27',
                        'child' =>
                        array(
                            381 => '和平区',
                            382 => '沈河区',
                            383 => '大东区',
                            384 => '皇姑区',
                            385 => '铁西区',
                            386 => '苏家屯区',
                            387 => '东陵区',
                            388 => '沈北新区',
                            389 => '于洪区',
                            390 => '辽中县',
                            391 => '康平县',
                            392 => '法库县',
                            393 => '新民市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '铁岭市',
                        'order' => '28',
                        'child' =>
                        array(
                            394 => '银州区',
                            395 => '清河区',
                            396 => '铁岭县',
                            397 => '西丰县',
                            398 => '昌图县',
                            399 => '调兵山市',
                            400 => '开原市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '大连市',
                        'order' => '29',
                        'child' =>
                        array(
                            401 => '长海县',
                            402 => '旅顺口区',
                            403 => '中山区',
                            404 => '西岗区',
                            405 => '沙河口区',
                            406 => '甘井子区',
                            407 => '金州区',
                            408 => '普兰店市',
                            409 => '瓦房店市',
                            410 => '庄河市',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '鞍山市',
                        'order' => '30',
                        'child' =>
                        array(
                            411 => '铁东区',
                            412 => '铁西区',
                            413 => '立山区',
                            414 => '千山区',
                            415 => '台安县',
                            416 => '岫岩满族自治县',
                            417 => '海城市',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '抚顺市',
                        'order' => '31',
                        'child' =>
                        array(
                            418 => '新抚区',
                            419 => '东洲区',
                            420 => '望花区',
                            421 => '顺城区',
                            422 => '抚顺县',
                            423 => '新宾满族自治县',
                            424 => '清原满族自治县',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '本溪市',
                        'order' => '32',
                        'child' =>
                        array(
                            425 => '平山区',
                            426 => '溪湖区',
                            427 => '明山区',
                            428 => '南芬区',
                            429 => '本溪满族自治县',
                            430 => '桓仁满族自治县',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '丹东市',
                        'order' => '33',
                        'child' =>
                        array(
                            431 => '元宝区',
                            432 => '振兴区',
                            433 => '振安区',
                            434 => '宽甸满族自治县',
                            435 => '东港市',
                            436 => '凤城市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '锦州市',
                        'order' => '34',
                        'child' =>
                        array(
                            437 => '古塔区',
                            438 => '凌河区',
                            439 => '太和区',
                            440 => '黑山县',
                            441 => '义县',
                            442 => '凌海市',
                            443 => '北镇市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '营口市',
                        'order' => '35',
                        'child' =>
                        array(
                            444 => '站前区',
                            445 => '西市区',
                            446 => '鮁鱼圈区',
                            447 => '老边区',
                            448 => '盖州市',
                            449 => '大石桥市',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '阜新市',
                        'order' => '36',
                        'child' =>
                        array(
                            450 => '海州区',
                            451 => '新邱区',
                            452 => '太平区',
                            453 => '清河门区',
                            454 => '细河区',
                            455 => '阜新蒙古族自治县',
                            456 => '彰武县',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '辽阳市',
                        'order' => '37',
                        'child' =>
                        array(
                            457 => '白塔区',
                            458 => '文圣区',
                            459 => '宏伟区',
                            460 => '弓长岭区',
                            461 => '太子河区',
                            462 => '辽阳县',
                            463 => '灯塔市',
                        ),
                    ),
                    11 =>
                    array(
                        'name' => '朝阳市',
                        'order' => '38',
                        'child' =>
                        array(
                            464 => '双塔区',
                            465 => '龙城区',
                            466 => '朝阳县',
                            467 => '建平县',
                            468 => '喀喇沁左翼蒙古族自治县',
                            469 => '北票市',
                            470 => '凌源市',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '盘锦市',
                        'order' => '39',
                        'child' =>
                        array(
                            471 => '双台子区',
                            472 => '兴隆台区',
                            473 => '大洼县',
                            474 => '盘山县',
                        ),
                    ),
                    13 =>
                    array(
                        'name' => '葫芦岛市',
                        'order' => '40',
                        'child' =>
                        array(
                            475 => '连山区',
                            476 => '龙港区',
                            477 => '南票区',
                            478 => '绥中县',
                            479 => '建昌县',
                            480 => '兴城市',
                        ),
                    ),
                ),
            ),
            6 =>
            array(
                'name' => '吉林省',
                'order' => '9',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '长春市',
                        'order' => '41',
                        'child' =>
                        array(
                            481 => '南关区',
                            482 => '宽城区',
                            483 => '朝阳区',
                            484 => '二道区',
                            485 => '绿园区',
                            486 => '双阳区',
                            487 => '农安县',
                            488 => '九台市',
                            489 => '榆树市',
                            490 => '德惠市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '吉林市',
                        'order' => '42',
                        'child' =>
                        array(
                            491 => '昌邑区',
                            492 => '龙潭区',
                            493 => '船营区',
                            494 => '丰满区',
                            495 => '永吉县',
                            496 => '蛟河市',
                            497 => '桦甸市',
                            498 => '舒兰市',
                            499 => '磐石市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '延边朝鲜族自治州',
                        'order' => '43',
                        'child' =>
                        array(
                            500 => '延吉市',
                            501 => '图们市',
                            502 => '敦化市',
                            503 => '珲春市',
                            504 => '龙井市',
                            505 => '和龙市',
                            506 => '汪清县',
                            507 => '安图县',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '四平市',
                        'order' => '44',
                        'child' =>
                        array(
                            508 => '铁西区',
                            509 => '铁东区',
                            510 => '梨树县',
                            511 => '伊通满族自治县',
                            512 => '公主岭市',
                            513 => '双辽市',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '通化市',
                        'order' => '45',
                        'child' =>
                        array(
                            514 => '东昌区',
                            515 => '二道江区',
                            516 => '通化县',
                            517 => '辉南县',
                            518 => '柳河县',
                            519 => '梅河口市',
                            520 => '集安市',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '白城市',
                        'order' => '46',
                        'child' =>
                        array(
                            521 => '洮北区',
                            522 => '镇赉县',
                            523 => '通榆县',
                            524 => '洮南市',
                            525 => '大安市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '辽源市',
                        'order' => '47',
                        'child' =>
                        array(
                            526 => '龙山区',
                            527 => '西安区',
                            528 => '东丰县',
                            529 => '东辽县',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '松原市',
                        'order' => '48',
                        'child' =>
                        array(
                            530 => '宁江区',
                            531 => '前郭尔罗斯蒙古族自治县',
                            532 => '长岭县',
                            533 => '乾安县',
                            534 => '扶余县',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '白山市',
                        'order' => '49',
                        'child' =>
                        array(
                            535 => '八道江区',
                            536 => '江源区',
                            537 => '抚松县',
                            538 => '靖宇县',
                            539 => '长白朝鲜族自治县',
                            540 => '临江市',
                        ),
                    ),
                ),
            ),
            7 =>
            array(
                'name' => '黑龙江省',
                'order' => '10',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '哈尔滨市',
                        'order' => '50',
                        'child' =>
                        array(
                            541 => '道里区',
                            542 => '南岗区',
                            543 => '道外区',
                            544 => '平房区',
                            545 => '松北区',
                            546 => '香坊区',
                            547 => '呼兰区',
                            548 => '阿城区',
                            549 => '依兰县',
                            550 => '方正县',
                            551 => '宾县',
                            552 => '巴彦县',
                            553 => '木兰县',
                            554 => '通河县',
                            555 => '延寿县',
                            556 => '双城市',
                            557 => '尚志市',
                            558 => '五常市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '齐齐哈尔市',
                        'order' => '51',
                        'child' =>
                        array(
                            559 => '龙沙区',
                            560 => '建华区',
                            561 => '铁锋区',
                            562 => '昂昂溪区',
                            563 => '富拉尔基区',
                            564 => '碾子山区',
                            565 => '梅里斯达翰尔族区',
                            566 => '龙江县',
                            567 => '依安县',
                            568 => '泰来县',
                            569 => '甘南县',
                            570 => '富裕县',
                            571 => '克山县',
                            572 => '克东县',
                            573 => '拜泉县',
                            574 => '讷河市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '鸡西市',
                        'order' => '52',
                        'child' =>
                        array(
                            575 => '鸡冠区',
                            576 => '恒山区',
                            577 => '滴道区',
                            578 => '梨树区',
                            579 => '城子河区',
                            580 => '麻山区',
                            581 => '鸡东县',
                            582 => '虎林市',
                            583 => '密山市',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '牡丹江市',
                        'order' => '53',
                        'child' =>
                        array(
                            584 => '东安区',
                            585 => '阳明区',
                            586 => '爱民区',
                            587 => '西安区',
                            588 => '东宁县',
                            589 => '林口县',
                            590 => '绥芬河市',
                            591 => '海林市',
                            592 => '宁安市',
                            593 => '穆棱市',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '七台河市',
                        'order' => '54',
                        'child' =>
                        array(
                            594 => '新兴区',
                            595 => '桃山区',
                            596 => '茄子河区',
                            597 => '勃利县',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '佳木斯市',
                        'order' => '55',
                        'child' =>
                        array(
                            598 => '向阳区',
                            599 => '前进区',
                            600 => '东风区',
                            601 => '桦南县',
                            602 => '桦川县',
                            603 => '汤原县',
                            604 => '抚远县',
                            605 => '同江市',
                            606 => '富锦市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '鹤岗市',
                        'order' => '56',
                        'child' =>
                        array(
                            607 => '向阳区',
                            608 => '工农区',
                            609 => '南山区',
                            610 => '兴安区',
                            611 => '东山区',
                            612 => '兴山区',
                            613 => '萝北县',
                            614 => '绥滨县',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '双鸭山市',
                        'order' => '57',
                        'child' =>
                        array(
                            615 => '尖山区',
                            616 => '岭东区',
                            617 => '四方台区',
                            618 => '宝山区',
                            619 => '集贤县',
                            620 => '友谊县',
                            621 => '宝清县',
                            622 => '饶河县',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '绥化市',
                        'order' => '58',
                        'child' =>
                        array(
                            623 => '北林区',
                            624 => '望奎县',
                            625 => '兰西县',
                            626 => '青冈县',
                            627 => '庆安县',
                            628 => '明水县',
                            629 => '绥棱县',
                            630 => '安达市',
                            631 => '肇东市',
                            632 => '海伦市',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '黑河市',
                        'order' => '59',
                        'child' =>
                        array(
                            633 => '爱辉区',
                            634 => '嫩江县',
                            635 => '逊克县',
                            636 => '孙吴县',
                            637 => '北安市',
                            638 => '五大连池市',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '大兴安岭地区',
                        'order' => '60',
                        'child' =>
                        array(
                            639 => '呼玛县',
                            640 => '塔河县',
                            641 => '漠河县',
                        ),
                    ),
                    11 =>
                    array(
                        'name' => '伊春市',
                        'order' => '61',
                        'child' =>
                        array(
                            642 => '伊春区',
                            643 => '南岔区',
                            644 => '友好区',
                            645 => '西林区',
                            646 => '翠峦区',
                            647 => '新青区',
                            648 => '美溪区',
                            649 => '金山屯区',
                            650 => '五营区',
                            651 => '乌马河区',
                            652 => '汤旺河区',
                            653 => '带岭区',
                            654 => '乌伊岭区',
                            655 => '红星区',
                            656 => '上甘岭区',
                            657 => '嘉荫县',
                            658 => '铁力市',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '大庆市',
                        'order' => '62',
                        'child' =>
                        array(
                            659 => '萨尔图区',
                            660 => '龙凤区',
                            661 => '让胡路区',
                            662 => '红岗区',
                            663 => '大同区',
                            664 => '肇州县',
                            665 => '肇源县',
                            666 => '林甸县',
                            667 => '杜尔伯特蒙古族自治县',
                        ),
                    ),
                ),
            ),
            8 =>
            array(
                'name' => '上海市',
                'order' => '3',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '上海市',
                        'order' => '3',
                        'child' =>
                        array(
                            37 => '黄浦区',
                            38 => '卢湾区',
                            39 => '徐汇区',
                            40 => '长宁区',
                            41 => '静安区',
                            42 => '普陀区',
                            43 => '闸北区',
                            44 => '虹口区',
                            45 => '杨浦区',
                            46 => '闵行区',
                            47 => '宝山区',
                            48 => '嘉定区',
                            49 => '浦东新区',
                            50 => '金山区',
                            51 => '松江区',
                            52 => '青浦区',
                            53 => '南汇区',
                            54 => '奉贤区',
                            55 => '崇明县',
                        ),
                    ),
                ),
            ),
            9 =>
            array(
                'name' => '江苏省',
                'order' => '11',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '南京市',
                        'order' => '63',
                        'child' =>
                        array(
                            668 => '江宁区',
                            669 => '浦口区',
                            670 => '玄武区',
                            671 => '白下区',
                            672 => '秦淮区',
                            673 => '建邺区',
                            674 => '鼓楼区',
                            675 => '下关区',
                            676 => '栖霞区',
                            677 => '雨花台区',
                            678 => '六合区',
                            679 => '溧水县',
                            680 => '高淳县',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '无锡市',
                        'order' => '64',
                        'child' =>
                        array(
                            681 => '崇安区',
                            682 => '南长区',
                            683 => '北塘区',
                            684 => '锡山区',
                            685 => '惠山区',
                            686 => '滨湖区',
                            687 => '江阴市',
                            688 => '宜兴市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '镇江市',
                        'order' => '65',
                        'child' =>
                        array(
                            689 => '京口区',
                            690 => '润州区',
                            691 => '丹徒区',
                            692 => '丹阳市',
                            693 => '扬中市',
                            694 => '句容市',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '苏州市',
                        'order' => '66',
                        'child' =>
                        array(
                            695 => '沧浪区',
                            696 => '常熟市',
                            697 => '平江区',
                            698 => '金阊区',
                            699 => '虎丘区',
                            700 => '昆山市',
                            701 => '太仓市',
                            702 => '吴江市',
                            703 => '吴中区',
                            704 => '相城区',
                            705 => '张家港市',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '南通市',
                        'order' => '67',
                        'child' =>
                        array(
                            706 => '崇川区',
                            707 => '港闸区',
                            708 => '海安县',
                            709 => '如东县',
                            710 => '启东市',
                            711 => '如皋市',
                            712 => '通州市',
                            713 => '海门市',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '扬州市',
                        'order' => '68',
                        'child' =>
                        array(
                            714 => '高邮市',
                            715 => '广陵区',
                            716 => '邗江区',
                            717 => '维扬区',
                            718 => '宝应县',
                            719 => '江都市',
                            720 => '仪征市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '盐城市',
                        'order' => '69',
                        'child' =>
                        array(
                            721 => '亭湖区',
                            722 => '盐都区',
                            723 => '响水县',
                            724 => '滨海县',
                            725 => '阜宁县',
                            726 => '射阳县',
                            727 => '建湖县',
                            728 => '东台市',
                            729 => '大丰市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '徐州市',
                        'order' => '70',
                        'child' =>
                        array(
                            730 => '鼓楼区',
                            731 => '云龙区',
                            732 => '九里区',
                            733 => '贾汪区',
                            734 => '泉山区',
                            735 => '丰县',
                            736 => '沛县',
                            737 => '铜山县',
                            738 => '睢宁县',
                            739 => '新沂市',
                            740 => '邳州市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '淮安市',
                        'order' => '71',
                        'child' =>
                        array(
                            741 => '清河区',
                            742 => '楚州区',
                            743 => '淮阴区',
                            744 => '清浦区',
                            745 => '涟水县',
                            746 => '洪泽县',
                            747 => '盱眙县',
                            748 => '金湖县',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '连云港市',
                        'order' => '72',
                        'child' =>
                        array(
                            749 => '连云区',
                            750 => '新浦区',
                            751 => '海州区',
                            752 => '赣榆县',
                            753 => '东海县',
                            754 => '灌云县',
                            755 => '灌南县',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '常州市',
                        'order' => '73',
                        'child' =>
                        array(
                            756 => '天宁区',
                            757 => '钟楼区',
                            758 => '戚墅堰区',
                            759 => '新北区',
                            760 => '武进区',
                            761 => '溧阳市',
                            762 => '金坛市',
                        ),
                    ),
                    11 =>
                    array(
                        'name' => '泰州市',
                        'order' => '74',
                        'child' =>
                        array(
                            763 => '海陵区',
                            764 => '高港区',
                            765 => '兴化市',
                            766 => '靖江市',
                            767 => '泰兴市',
                            768 => '姜堰市',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '宿迁市',
                        'order' => '75',
                        'child' =>
                        array(
                            769 => '宿城区',
                            770 => '宿豫区',
                            771 => '沭阳县',
                            772 => '泗阳县',
                            773 => '泗洪县',
                        ),
                    ),
                ),
            ),
            10 =>
            array(
                'name' => '浙江省',
                'order' => '12',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '舟山市',
                        'order' => '76',
                        'child' =>
                        array(
                            774 => '定海区',
                            775 => '普陀区',
                            776 => '岱山县',
                            777 => '嵊泗县',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '衢州市',
                        'order' => '77',
                        'child' =>
                        array(
                            778 => '柯城区',
                            779 => '衢江区',
                            780 => '常山县',
                            781 => '开化县',
                            782 => '龙游县',
                            783 => '江山市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '杭州市',
                        'order' => '78',
                        'child' =>
                        array(
                            784 => '上城区',
                            785 => '下城区',
                            786 => '江干区',
                            787 => '拱墅区',
                            788 => '西湖区',
                            789 => '滨江区',
                            790 => '余杭区',
                            791 => '桐庐县',
                            792 => '淳安县',
                            793 => '建德市',
                            794 => '富阳市',
                            795 => '临安市',
                            796 => '萧山区',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '湖州市',
                        'order' => '79',
                        'child' =>
                        array(
                            797 => '吴兴区',
                            798 => '南浔区',
                            799 => '德清县',
                            800 => '长兴县',
                            801 => '安吉县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '嘉兴市',
                        'order' => '80',
                        'child' =>
                        array(
                            802 => ' 南湖区',
                            803 => ' 秀洲区',
                            804 => ' 嘉善县',
                            805 => ' 海盐县',
                            806 => ' 海宁市',
                            807 => ' 平湖市',
                            808 => ' 桐乡市 ',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '宁波市',
                        'order' => '81',
                        'child' =>
                        array(
                            809 => '海曙区',
                            810 => '江东区',
                            811 => '江北区',
                            812 => '北仑区',
                            813 => '镇海区',
                            814 => '鄞州区',
                            815 => '象山县',
                            816 => '宁海县',
                            817 => '余姚市',
                            818 => '慈溪市',
                            819 => '奉化市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '绍兴市',
                        'order' => '82',
                        'child' =>
                        array(
                            820 => '越城区',
                            821 => '绍兴县',
                            822 => '新昌县',
                            823 => '诸暨市',
                            824 => '上虞市',
                            825 => '嵊州市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '温州市',
                        'order' => '83',
                        'child' =>
                        array(
                            826 => '鹿城区',
                            827 => '龙湾区',
                            828 => '瓯海区',
                            829 => '洞头县',
                            830 => '永嘉县',
                            831 => '平阳县',
                            832 => '苍南县',
                            833 => '文成县',
                            834 => '泰顺县',
                            835 => '瑞安市',
                            836 => '乐清市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '丽水市',
                        'order' => '84',
                        'child' =>
                        array(
                            837 => '莲都区',
                            838 => '青田县',
                            839 => '缙云县',
                            840 => '遂昌县',
                            841 => '松阳县',
                            842 => '云和县',
                            843 => '庆元县',
                            844 => '景宁畲族自治县',
                            845 => '龙泉市',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '金华市',
                        'order' => '85',
                        'child' =>
                        array(
                            846 => '婺城区',
                            847 => '金东区',
                            848 => '武义县',
                            849 => '浦江县',
                            850 => '磐安县',
                            851 => '兰溪市',
                            852 => '义乌市',
                            853 => '东阳市',
                            854 => '永康市',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '台州市',
                        'order' => '86',
                        'child' =>
                        array(
                            855 => '椒江区',
                            856 => '黄岩区',
                            857 => '路桥区',
                            858 => '玉环县',
                            859 => '三门县',
                            860 => '天台县',
                            861 => '仙居县',
                            862 => '温岭市',
                            863 => '临海市',
                        ),
                    ),
                ),
            ),
            11 =>
            array(
                'name' => '安徽省',
                'order' => '13',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '合肥市',
                        'order' => '87',
                        'child' =>
                        array(
                            864 => '瑶海区',
                            865 => '庐阳区',
                            866 => '蜀山区',
                            867 => '包河区',
                            868 => '长丰县',
                            869 => '肥东县',
                            870 => '肥西县',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '芜湖市',
                        'order' => '88',
                        'child' =>
                        array(
                            871 => '镜湖区',
                            872 => '弋江区',
                            873 => '鸠江区',
                            874 => '三山区',
                            875 => '芜湖县',
                            876 => '繁昌县',
                            877 => '南陵县',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '蚌埠市',
                        'order' => '89',
                        'child' =>
                        array(
                            878 => '龙子湖区',
                            879 => '蚌山区',
                            880 => '禹会区',
                            881 => '淮上区',
                            882 => '怀远县',
                            883 => '五河县',
                            884 => '固镇县',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '淮南市',
                        'order' => '90',
                        'child' =>
                        array(
                            885 => '大通区',
                            886 => '田家庵区',
                            887 => '谢家集区',
                            888 => '八公山区',
                            889 => '潘集区',
                            890 => '凤台县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '马鞍山市',
                        'order' => '91',
                        'child' =>
                        array(
                            891 => '金家庄区',
                            892 => '花山区',
                            893 => '雨山区',
                            894 => '当涂县',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '淮北市',
                        'order' => '92',
                        'child' =>
                        array(
                            895 => '杜集区',
                            896 => '相山区',
                            897 => '烈山区',
                            898 => '濉溪县 ',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '铜陵市',
                        'order' => '93',
                        'child' =>
                        array(
                            899 => '铜官山区',
                            900 => '狮子山区',
                            901 => '铜陵县',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '安庆市',
                        'order' => '94',
                        'child' =>
                        array(
                            902 => '迎江区',
                            903 => '大观区',
                            904 => '宜秀区',
                            905 => '怀宁县',
                            906 => '枞阳县',
                            907 => '潜山县',
                            908 => '太湖县',
                            909 => '宿松县',
                            910 => '望江县',
                            911 => '岳西县',
                            912 => '桐城市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '黄山市',
                        'order' => '95',
                        'child' =>
                        array(
                            913 => '屯溪区',
                            914 => '黄山区',
                            915 => '徽州区',
                            916 => '歙县',
                            917 => '休宁县',
                            918 => '黟县',
                            919 => '祁门县',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '滁州市',
                        'order' => '96',
                        'child' =>
                        array(
                            920 => '琅琊区',
                            921 => '南谯区',
                            922 => '来安县',
                            923 => '全椒县',
                            924 => '定远县',
                            925 => '凤阳县',
                            926 => '天长市',
                            927 => '明光市',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '阜阳市',
                        'order' => '97',
                        'child' =>
                        array(
                            928 => '颍州区',
                            929 => '颍东区',
                            930 => '颍泉区',
                            931 => '临泉县',
                            932 => '太和县',
                            933 => '阜南县',
                            934 => '颍上县',
                            935 => '界首市',
                        ),
                    ),
                    11 =>
                    array(
                        'name' => '宿州市',
                        'order' => '98',
                        'child' =>
                        array(
                            936 => '埇桥区',
                            937 => '砀山县',
                            938 => '萧县',
                            939 => '灵璧县',
                            940 => '泗县 ',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '巢湖市',
                        'order' => '99',
                        'child' =>
                        array(
                            941 => '居巢区',
                            942 => '庐江县',
                            943 => '无为县',
                            944 => '含山县',
                            945 => '和县 ',
                        ),
                    ),
                    13 =>
                    array(
                        'name' => '六安市',
                        'order' => '100',
                        'child' =>
                        array(
                            946 => '金安区',
                            947 => '裕安区',
                            948 => '寿县',
                            949 => '霍邱县',
                            950 => '舒城县',
                            951 => '金寨县',
                            952 => '霍山县',
                        ),
                    ),
                    14 =>
                    array(
                        'name' => '亳州市',
                        'order' => '101',
                        'child' =>
                        array(
                            953 => '谯城区',
                            954 => '涡阳县',
                            955 => '蒙城县',
                            956 => '利辛县',
                        ),
                    ),
                    15 =>
                    array(
                        'name' => '池州市',
                        'order' => '102',
                        'child' =>
                        array(
                            957 => '贵池区',
                            958 => '东至县',
                            959 => '石台县',
                            960 => '青阳县',
                        ),
                    ),
                    16 =>
                    array(
                        'name' => '宣城市',
                        'order' => '103',
                        'child' =>
                        array(
                            961 => '宣州区',
                            962 => '郎溪县',
                            963 => '广德县',
                            964 => '泾县',
                            965 => '绩溪县',
                            966 => '旌德县',
                            967 => '宁国市',
                        ),
                    ),
                ),
            ),
            12 =>
            array(
                'name' => '福建省',
                'order' => '14',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '福州市',
                        'order' => '104',
                        'child' =>
                        array(
                            968 => '鼓楼区',
                            969 => '台江区',
                            970 => '仓山区',
                            971 => '马尾区',
                            972 => '晋安区',
                            973 => '闽侯县',
                            974 => '连江县',
                            975 => '罗源县',
                            976 => '闽清县',
                            977 => '永泰县',
                            978 => '平潭县',
                            979 => '福清市',
                            980 => '长乐市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '厦门市',
                        'order' => '105',
                        'child' =>
                        array(
                            981 => '思明区',
                            982 => '海沧区',
                            983 => '湖里区',
                            984 => '集美区',
                            985 => '同安区',
                            986 => '翔安区',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '宁德市',
                        'order' => '106',
                        'child' =>
                        array(
                            987 => '蕉城区',
                            988 => '霞浦县',
                            989 => '古田县',
                            990 => '屏南县',
                            991 => '寿宁县',
                            992 => '周宁县',
                            993 => '柘荣县',
                            994 => '福安市',
                            995 => '福鼎市',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '莆田市',
                        'order' => '107',
                        'child' =>
                        array(
                            996 => '城厢区',
                            997 => '涵江区',
                            998 => '荔城区',
                            999 => '秀屿区',
                            1000 => '仙游县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '泉州市',
                        'order' => '108',
                        'child' =>
                        array(
                            1001 => '鲤城区',
                            1002 => '丰泽区',
                            1003 => '洛江区',
                            1004 => '泉港区',
                            1005 => '惠安县',
                            1006 => '安溪县',
                            1007 => '永春县',
                            1008 => '德化县',
                            1009 => '石狮市',
                            1010 => '晋江市',
                            1011 => '南安市',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '漳州市',
                        'order' => '109',
                        'child' =>
                        array(
                            1012 => '芗城区',
                            1013 => '龙文区',
                            1014 => '云霄县',
                            1015 => '漳浦县',
                            1016 => '诏安县',
                            1017 => '长泰县',
                            1018 => '东山县',
                            1019 => '南靖县',
                            1020 => '平和县',
                            1021 => '华安县',
                            1022 => '龙海市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '龙岩市',
                        'order' => '110',
                        'child' =>
                        array(
                            1023 => '新罗区',
                            1024 => '长汀县',
                            1025 => '永定县',
                            1026 => '上杭县',
                            1027 => '武平县',
                            1028 => '连城县',
                            1029 => '漳平市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '三明市',
                        'order' => '111',
                        'child' =>
                        array(
                            1030 => '梅列区',
                            1031 => '三元区',
                            1032 => '明溪县',
                            1033 => '清流县',
                            1034 => '宁化县',
                            1035 => '大田县',
                            1036 => '尤溪县',
                            1037 => '沙县',
                            1038 => '将乐县',
                            1039 => '泰宁县',
                            1040 => '建宁县',
                            1041 => '永安市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '南平市',
                        'order' => '112',
                        'child' =>
                        array(
                            1042 => '延平区',
                            1043 => '顺昌县',
                            1044 => '浦城县',
                            1045 => '光泽县',
                            1046 => '松溪县',
                            1047 => '政和县',
                            1048 => '邵武市',
                            1049 => '武夷山市',
                            1050 => '建瓯市',
                            1051 => '建阳市',
                        ),
                    ),
                ),
            ),
            13 =>
            array(
                'name' => '江西省',
                'order' => '15',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '鹰潭市',
                        'order' => '113',
                        'child' =>
                        array(
                            1052 => '月湖区',
                            1053 => '余江县',
                            1054 => '贵溪市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '新余市',
                        'order' => '114',
                        'child' =>
                        array(
                            1055 => '渝水区',
                            1056 => '分宜县',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '南昌市',
                        'order' => '115',
                        'child' =>
                        array(
                            1057 => '东湖区',
                            1058 => '西湖区',
                            1059 => '青云谱区',
                            1060 => '湾里区',
                            1061 => '青山湖区',
                            1062 => '南昌县',
                            1063 => '新建县',
                            1064 => '安义县',
                            1065 => '进贤县',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '九江市',
                        'order' => '116',
                        'child' =>
                        array(
                            1066 => '庐山区',
                            1067 => '浔阳区',
                            1068 => '九江县',
                            1069 => '武宁县',
                            1070 => '修水县',
                            1071 => '永修县',
                            1072 => '德安县',
                            1073 => '星子县',
                            1074 => '都昌县',
                            1075 => '湖口县',
                            1076 => '彭泽县',
                            1077 => '瑞昌市',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '上饶市',
                        'order' => '117',
                        'child' =>
                        array(
                            1078 => '信州区',
                            1079 => '上饶县',
                            1080 => '广丰县',
                            1081 => '玉山县',
                            1082 => '铅山县',
                            1083 => '横峰县',
                            1084 => '弋阳县',
                            1085 => '余干县',
                            1086 => '鄱阳县',
                            1087 => '万年县',
                            1088 => '婺源县',
                            1089 => '德兴市',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '抚州市',
                        'order' => '118',
                        'child' =>
                        array(
                            1090 => '临川区',
                            1091 => '南城县',
                            1092 => '黎川县',
                            1093 => '南丰县',
                            1094 => '崇仁县',
                            1095 => '乐安县',
                            1096 => '宜黄县',
                            1097 => '金溪县',
                            1098 => '资溪县',
                            1099 => '东乡县',
                            1100 => '广昌县',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '宜春市',
                        'order' => '119',
                        'child' =>
                        array(
                            1101 => '袁州区',
                            1102 => '奉新县',
                            1103 => '万载县',
                            1104 => '上高县',
                            1105 => '宜丰县',
                            1106 => '靖安县',
                            1107 => '铜鼓县',
                            1108 => '丰城市',
                            1109 => '樟树市',
                            1110 => '高安市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '吉安市',
                        'order' => '120',
                        'child' =>
                        array(
                            1111 => '吉州区',
                            1112 => '青原区',
                            1113 => '吉安县',
                            1114 => '吉水县',
                            1115 => '峡江县',
                            1116 => '新干县',
                            1117 => '永丰县',
                            1118 => '泰和县',
                            1119 => '遂川县',
                            1120 => '万安县',
                            1121 => '安福县',
                            1122 => '永新县',
                            1123 => '井冈山市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '赣州市',
                        'order' => '121',
                        'child' =>
                        array(
                            1124 => '章贡区',
                            1125 => '赣县',
                            1126 => '信丰县',
                            1127 => '大余县',
                            1128 => '上犹县',
                            1129 => '崇义县',
                            1130 => '安远县',
                            1131 => '龙南县',
                            1132 => '定南县',
                            1133 => '全南县',
                            1134 => '宁都县',
                            1135 => '于都县',
                            1136 => '兴国县',
                            1137 => '会昌县',
                            1138 => '寻乌县',
                            1139 => '石城县',
                            1140 => '瑞金市',
                            1141 => '南康市',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '景德镇市',
                        'order' => '122',
                        'child' =>
                        array(
                            1142 => '昌江区',
                            1143 => '珠山区',
                            1144 => '浮梁县',
                            1145 => '乐平市',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '萍乡市',
                        'order' => '123',
                        'child' =>
                        array(
                            1146 => '安源区',
                            1147 => '湘东区',
                            1148 => '莲花县',
                            1149 => '上栗县',
                            1150 => '芦溪县',
                        ),
                    ),
                ),
            ),
            14 =>
            array(
                'name' => '山东省',
                'order' => '16',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '菏泽市',
                        'order' => '124',
                        'child' =>
                        array(
                            1151 => '牡丹区',
                            1152 => '曹县',
                            1153 => '单县',
                            1154 => '成武县',
                            1155 => '巨野县',
                            1156 => '郓城县',
                            1157 => '鄄城县',
                            1158 => '定陶县',
                            1159 => '东明县',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '济南市',
                        'order' => '125',
                        'child' =>
                        array(
                            1160 => '历下区',
                            1161 => '市中区',
                            1162 => '槐荫区',
                            1163 => '天桥区',
                            1164 => '历城区',
                            1165 => '长清区',
                            1166 => '平阴县',
                            1167 => '济阳县',
                            1168 => '商河县',
                            1169 => '章丘市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '青岛市',
                        'order' => '126',
                        'child' =>
                        array(
                            1170 => '市南区',
                            1171 => '市北区',
                            1172 => '四方区',
                            1173 => '黄岛区',
                            1174 => '崂山区',
                            1175 => '李沧区',
                            1176 => '城阳区',
                            1177 => '胶州市',
                            1178 => '即墨市',
                            1179 => '平度市',
                            1180 => '胶南市',
                            1181 => '莱西市',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '淄博市',
                        'order' => '127',
                        'child' =>
                        array(
                            1182 => '淄川区',
                            1183 => '张店区',
                            1184 => '博山区',
                            1185 => '临淄区',
                            1186 => '周村区',
                            1187 => '桓台县',
                            1188 => '高青县',
                            1189 => '沂源县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '德州市',
                        'order' => '128',
                        'child' =>
                        array(
                            1190 => '德城区',
                            1191 => '陵县',
                            1192 => '宁津县',
                            1193 => '庆云县',
                            1194 => '临邑县',
                            1195 => '齐河县',
                            1196 => '平原县',
                            1197 => '夏津县',
                            1198 => '武城县',
                            1199 => '乐陵市',
                            1200 => '禹城市',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '烟台市',
                        'order' => '129',
                        'child' =>
                        array(
                            1201 => '芝罘区',
                            1202 => '福山区',
                            1203 => '牟平区',
                            1204 => '莱山区',
                            1205 => '长岛县',
                            1206 => '龙口市',
                            1207 => '莱阳市',
                            1208 => '莱州市',
                            1209 => '蓬莱市',
                            1210 => '招远市',
                            1211 => '栖霞市',
                            1212 => '海阳市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '潍坊市',
                        'order' => '130',
                        'child' =>
                        array(
                            1213 => '潍城区',
                            1214 => '寒亭区',
                            1215 => '坊子区',
                            1216 => '奎文区',
                            1217 => '临朐县',
                            1218 => '昌乐县',
                            1219 => '青州市',
                            1220 => '诸城市',
                            1221 => '寿光市',
                            1222 => '安丘市',
                            1223 => '高密市',
                            1224 => '昌邑市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '济宁市',
                        'order' => '131',
                        'child' =>
                        array(
                            1225 => '市中区',
                            1226 => '任城区',
                            1227 => '微山县',
                            1228 => '鱼台县',
                            1229 => '金乡县',
                            1230 => '嘉祥县',
                            1231 => '汶上县',
                            1232 => '泗水县',
                            1233 => '梁山县',
                            1234 => '曲阜市',
                            1235 => '兖州市',
                            1236 => '邹城市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '泰安市',
                        'order' => '132',
                        'child' =>
                        array(
                            1237 => '泰山区',
                            1238 => '岱岳区',
                            1239 => '宁阳县',
                            1240 => '东平县',
                            1241 => '新泰市',
                            1242 => '肥城市',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '临沂市',
                        'order' => '133',
                        'child' =>
                        array(
                            1243 => '兰山区',
                            1244 => '罗庄区',
                            1245 => '河东区',
                            1246 => '沂南县',
                            1247 => '郯城县',
                            1248 => '沂水县',
                            1249 => '苍山县',
                            1250 => '费县',
                            1251 => '平邑县',
                            1252 => '莒南县',
                            1253 => '蒙阴县',
                            1254 => '临沭县',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '滨州市',
                        'order' => '134',
                        'child' =>
                        array(
                            1255 => '滨城区',
                            1256 => '惠民县',
                            1257 => '阳信县',
                            1258 => '无棣县',
                            1259 => '沾化县',
                            1260 => '博兴县',
                            1261 => '邹平县',
                        ),
                    ),
                    11 =>
                    array(
                        'name' => '东营市',
                        'order' => '135',
                        'child' =>
                        array(
                            1262 => '东营区',
                            1263 => '河口区',
                            1264 => '垦利县',
                            1265 => '利津县',
                            1266 => '广饶县',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '威海市',
                        'order' => '136',
                        'child' =>
                        array(
                            1267 => '环翠区',
                            1268 => '文登市',
                            1269 => '荣成市',
                            1270 => '乳山市',
                        ),
                    ),
                    13 =>
                    array(
                        'name' => '枣庄市',
                        'order' => '137',
                        'child' =>
                        array(
                            1271 => '市中区',
                            1272 => '薛城区',
                            1273 => '峄城区',
                            1274 => '台儿庄区',
                            1275 => '山亭区',
                            1276 => '滕州市',
                        ),
                    ),
                    14 =>
                    array(
                        'name' => '日照市',
                        'order' => '138',
                        'child' =>
                        array(
                            1277 => '东港区',
                            1278 => '岚山区',
                            1279 => '五莲县',
                            1280 => '莒县',
                        ),
                    ),
                    15 =>
                    array(
                        'name' => '莱芜市',
                        'order' => '139',
                        'child' =>
                        array(
                            1281 => '莱城区',
                            1282 => '钢城区',
                        ),
                    ),
                    16 =>
                    array(
                        'name' => '聊城市',
                        'order' => '140',
                        'child' =>
                        array(
                            1283 => '东昌府区',
                            1284 => '阳谷县',
                            1285 => '莘县',
                            1286 => '茌平县',
                            1287 => '东阿县',
                            1288 => '冠县',
                            1289 => '高唐县',
                            1290 => '临清市',
                        ),
                    ),
                ),
            ),
            15 =>
            array(
                'name' => '河南省',
                'order' => '17',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '商丘市',
                        'order' => '141',
                        'child' =>
                        array(
                            1291 => '梁园区',
                            1292 => '睢阳区',
                            1293 => '民权县',
                            1294 => '睢县',
                            1295 => '宁陵县',
                            1296 => '柘城县',
                            1297 => '虞城县',
                            1298 => '夏邑县',
                            1299 => '永城市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '郑州市',
                        'order' => '142',
                        'child' =>
                        array(
                            1300 => '中原区',
                            1301 => '二七区',
                            1302 => '管城回族区',
                            1303 => '金水区',
                            1304 => '上街区',
                            1305 => '惠济区',
                            1306 => '中牟县',
                            1307 => '巩义市',
                            1308 => '荥阳市',
                            1309 => '新密市',
                            1310 => '新郑市',
                            1311 => '登封市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '安阳市',
                        'order' => '143',
                        'child' =>
                        array(
                            1312 => '文峰区',
                            1313 => '北关区',
                            1314 => '殷都区',
                            1315 => '龙安区',
                            1316 => '安阳县',
                            1317 => '汤阴县',
                            1318 => '滑县',
                            1319 => '内黄县',
                            1320 => '林州市',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '新乡市',
                        'order' => '144',
                        'child' =>
                        array(
                            1321 => '红旗区',
                            1322 => '卫滨区',
                            1323 => '凤泉区',
                            1324 => '牧野区',
                            1325 => '新乡县',
                            1326 => '获嘉县',
                            1327 => '原阳县',
                            1328 => '延津县',
                            1329 => '封丘县',
                            1330 => '长垣县',
                            1331 => '卫辉市',
                            1332 => '辉县市',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '许昌市',
                        'order' => '145',
                        'child' =>
                        array(
                            1333 => '魏都区',
                            1334 => '许昌县',
                            1335 => '鄢陵县',
                            1336 => '襄城县',
                            1337 => '禹州市',
                            1338 => '长葛市',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '平顶山市',
                        'order' => '146',
                        'child' =>
                        array(
                            1339 => '新华区',
                            1340 => '卫东区',
                            1341 => '石龙区',
                            1342 => '湛河区',
                            1343 => '宝丰县',
                            1344 => '叶县',
                            1345 => '鲁山县',
                            1346 => '郏县',
                            1347 => '舞钢市',
                            1348 => '汝州市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '信阳市',
                        'order' => '147',
                        'child' =>
                        array(
                            1349 => '浉河区',
                            1350 => '平桥区',
                            1351 => '罗山县',
                            1352 => '光山县',
                            1353 => '新县',
                            1354 => '商城县',
                            1355 => '固始县',
                            1356 => '潢川县',
                            1357 => '淮滨县',
                            1358 => '息县',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '南阳市',
                        'order' => '148',
                        'child' =>
                        array(
                            1359 => '宛城区',
                            1360 => '卧龙区',
                            1361 => '南召县',
                            1362 => '方城县',
                            1363 => '西峡县',
                            1364 => '镇平县',
                            1365 => '内乡县',
                            1366 => '淅川县',
                            1367 => '社旗县',
                            1368 => '唐河县',
                            1369 => '新野县',
                            1370 => '桐柏县',
                            1371 => '邓州市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '开封市',
                        'order' => '149',
                        'child' =>
                        array(
                            1372 => '龙亭区',
                            1373 => '顺河回族区',
                            1374 => '鼓楼区',
                            1375 => '禹王台区',
                            1376 => '金明区',
                            1377 => '杞县',
                            1378 => '通许县',
                            1379 => '尉氏县',
                            1380 => '开封县',
                            1381 => '兰考县',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '洛阳市',
                        'order' => '150',
                        'child' =>
                        array(
                            1382 => '老城区',
                            1383 => '西工区',
                            1384 => '瀍河回族区',
                            1385 => '涧西区',
                            1386 => '吉利区',
                            1387 => '洛龙区',
                            1388 => '孟津县',
                            1389 => '新安县',
                            1390 => '栾川县',
                            1391 => '嵩县',
                            1392 => '汝阳县',
                            1393 => '宜阳县',
                            1394 => '洛宁县',
                            1395 => '伊川县',
                            1396 => '偃师市',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '济源市',
                        'order' => '151',
                    ),
                    11 =>
                    array(
                        'name' => '焦作市',
                        'order' => '152',
                        'child' =>
                        array(
                            1397 => '解放区',
                            1398 => '中站区',
                            1399 => '马村区',
                            1400 => '山阳区',
                            1401 => '修武县',
                            1402 => '博爱县',
                            1403 => '武陟县',
                            1404 => '温县',
                            1405 => '沁阳市',
                            1406 => '孟州市',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '鹤壁市',
                        'order' => '153',
                        'child' =>
                        array(
                            1407 => '鹤山区',
                            1408 => '山城区',
                            1409 => '淇滨区',
                            1410 => '浚县',
                            1411 => '淇县',
                        ),
                    ),
                    13 =>
                    array(
                        'name' => '濮阳市',
                        'order' => '154',
                        'child' =>
                        array(
                            1412 => '华龙区',
                            1413 => '清丰县',
                            1414 => '南乐县',
                            1415 => '范县',
                            1416 => '台前县',
                            1417 => '濮阳县',
                        ),
                    ),
                    14 =>
                    array(
                        'name' => '周口市',
                        'order' => '155',
                        'child' =>
                        array(
                            1418 => '川汇区',
                            1419 => '扶沟县',
                            1420 => '西华县',
                            1421 => '商水县',
                            1422 => '沈丘县',
                            1423 => '郸城县',
                            1424 => '淮阳县',
                            1425 => '太康县',
                            1426 => '鹿邑县',
                            1427 => '项城市',
                        ),
                    ),
                    15 =>
                    array(
                        'name' => '漯河市',
                        'order' => '156',
                        'child' =>
                        array(
                            1428 => '源汇区',
                            1429 => '郾城区',
                            1430 => '召陵区',
                            1431 => '舞阳县',
                            1432 => '临颍县',
                        ),
                    ),
                    16 =>
                    array(
                        'name' => '驻马店市',
                        'order' => '157',
                        'child' =>
                        array(
                            1433 => '驿城区',
                            1434 => '西平县',
                            1435 => '上蔡县',
                            1436 => '平舆县',
                            1437 => '正阳县',
                            1438 => '确山县',
                            1439 => '泌阳县',
                            1440 => '汝南县',
                            1441 => '遂平县',
                            1442 => '新蔡县',
                        ),
                    ),
                    17 =>
                    array(
                        'name' => '三门峡市',
                        'order' => '158',
                        'child' =>
                        array(
                            1443 => '湖滨区',
                            1444 => '渑池县',
                            1445 => '陕县',
                            1446 => '卢氏县',
                            1447 => '义马市',
                            1448 => '灵宝市',
                        ),
                    ),
                ),
            ),
            16 =>
            array(
                'name' => '湖北省',
                'order' => '18',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '武汉市',
                        'order' => '159',
                        'child' =>
                        array(
                            1449 => '江岸区',
                            1450 => '江汉区',
                            1451 => '硚口区',
                            1452 => '汉阳区',
                            1453 => '武昌区',
                            1454 => '青山区',
                            1455 => '洪山区',
                            1456 => '东西湖区',
                            1457 => '汉南区',
                            1458 => '蔡甸区',
                            1459 => '江夏区',
                            1460 => '黄陂区',
                            1461 => '新洲区',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '襄樊市',
                        'order' => '160',
                        'child' =>
                        array(
                            1462 => '襄城区',
                            1463 => '樊城区',
                            1464 => '襄阳区',
                            1465 => '南漳县',
                            1466 => '谷城县',
                            1467 => '保康县',
                            1468 => '老河口市',
                            1469 => '枣阳市',
                            1470 => '宜城市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '鄂州市',
                        'order' => '161',
                        'child' =>
                        array(
                            1471 => '梁子湖区',
                            1472 => '华容区',
                            1473 => '鄂城区',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '孝感市',
                        'order' => '162',
                        'child' =>
                        array(
                            1474 => '孝南区',
                            1475 => '孝昌县',
                            1476 => '大悟县',
                            1477 => '云梦县',
                            1478 => '应城市',
                            1479 => '安陆市',
                            1480 => '汉川市',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '黄冈市',
                        'order' => '163',
                        'child' =>
                        array(
                            1481 => '黄州区',
                            1482 => '团风县',
                            1483 => '红安县',
                            1484 => '罗田县',
                            1485 => '英山县',
                            1486 => '浠水县',
                            1487 => '蕲春县',
                            1488 => '黄梅县',
                            1489 => '麻城市',
                            1490 => '武穴市',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '黄石市',
                        'order' => '164',
                        'child' =>
                        array(
                            1491 => '黄石港区',
                            1492 => '西塞山区',
                            1493 => '下陆区',
                            1494 => '铁山区',
                            1495 => '阳新县',
                            1496 => '大冶市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '咸宁市',
                        'order' => '165',
                        'child' =>
                        array(
                            1497 => '咸安区',
                            1498 => '嘉鱼县',
                            1499 => '通城县',
                            1500 => '崇阳县',
                            1501 => '通山县',
                            1502 => '赤壁市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '荆州市',
                        'order' => '166',
                        'child' =>
                        array(
                            1503 => '沙市区',
                            1504 => '荆州区',
                            1505 => '公安县',
                            1506 => '监利县',
                            1507 => '江陵县',
                            1508 => '石首市',
                            1509 => '洪湖市',
                            1510 => '松滋市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '宜昌市',
                        'order' => '167',
                        'child' =>
                        array(
                            1511 => '西陵区',
                            1512 => '伍家岗区',
                            1513 => '点军区',
                            1514 => '猇亭区',
                            1515 => '夷陵区',
                            1516 => '远安县',
                            1517 => '兴山县',
                            1518 => '秭归县',
                            1519 => '长阳土家族自治县',
                            1520 => '五峰土家族自治县',
                            1521 => '宜都市',
                            1522 => '当阳市',
                            1523 => '枝江市',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '恩施土家族苗族自治州',
                        'order' => '168',
                        'child' =>
                        array(
                            1524 => '恩施市',
                            1525 => '利川市',
                            1526 => '建始县',
                            1527 => '巴东县',
                            1528 => '宣恩县',
                            1529 => '咸丰县',
                            1530 => '来凤县',
                            1531 => '鹤峰县',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '神农架林区',
                        'order' => '169',
                    ),
                    11 =>
                    array(
                        'name' => '十堰市',
                        'order' => '170',
                        'child' =>
                        array(
                            1532 => '茅箭区',
                            1533 => '张湾区',
                            1534 => '郧县',
                            1535 => '郧西县',
                            1536 => '竹山县',
                            1537 => '竹溪县',
                            1538 => '房县',
                            1539 => '丹江口市',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '随州市',
                        'order' => '171',
                        'child' =>
                        array(
                            1540 => '曾都区',
                            1541 => '广水市',
                        ),
                    ),
                    13 =>
                    array(
                        'name' => '荆门市',
                        'order' => '172',
                        'child' =>
                        array(
                            1542 => '东宝区',
                            1543 => '掇刀区',
                            1544 => '京山县',
                            1545 => '沙洋县',
                            1546 => '钟祥市',
                        ),
                    ),
                    14 =>
                    array(
                        'name' => '仙桃市',
                        'order' => '173',
                    ),
                    15 =>
                    array(
                        'name' => '天门市',
                        'order' => '174',
                    ),
                    16 =>
                    array(
                        'name' => '潜江市',
                        'order' => '175',
                    ),
                ),
            ),
            17 =>
            array(
                'name' => '湖南省',
                'order' => '19',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '岳阳市',
                        'order' => '176',
                        'child' =>
                        array(
                            1547 => '岳阳楼区',
                            1548 => '云溪区',
                            1549 => '君山区',
                            1550 => '岳阳县',
                            1551 => '华容县',
                            1552 => '湘阴县',
                            1553 => '平江县',
                            1554 => '汨罗市',
                            1555 => '临湘市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '长沙市',
                        'order' => '177',
                        'child' =>
                        array(
                            1556 => '芙蓉区',
                            1557 => '天心区',
                            1558 => '岳麓区',
                            1559 => '开福区',
                            1560 => '雨花区',
                            1561 => '长沙县',
                            1562 => '望城县',
                            1563 => '宁乡县',
                            1564 => '浏阳市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '湘潭市',
                        'order' => '178',
                        'child' =>
                        array(
                            1565 => '雨湖区',
                            1566 => '岳塘区',
                            1567 => '湘潭县',
                            1568 => '湘乡市',
                            1569 => '韶山市',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '株洲市',
                        'order' => '179',
                        'child' =>
                        array(
                            1570 => '荷塘区',
                            1571 => '芦淞区',
                            1572 => '石峰区',
                            1573 => '天元区',
                            1574 => '株洲县',
                            1575 => '攸县',
                            1576 => '茶陵县',
                            1577 => '炎陵县',
                            1578 => '醴陵市',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '衡阳市',
                        'order' => '180',
                        'child' =>
                        array(
                            1579 => '珠晖区',
                            1580 => '雁峰区',
                            1581 => '石鼓区',
                            1582 => '蒸湘区',
                            1583 => '南岳区',
                            1584 => '衡阳县',
                            1585 => '衡南县',
                            1586 => '衡山县',
                            1587 => '衡东县',
                            1588 => '祁东县',
                            1589 => '耒阳市',
                            1590 => '常宁市',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '郴州市',
                        'order' => '181',
                        'child' =>
                        array(
                            1591 => '北湖区',
                            1592 => '苏仙区',
                            1593 => '桂阳县',
                            1594 => '宜章县',
                            1595 => '永兴县',
                            1596 => '嘉禾县',
                            1597 => '临武县',
                            1598 => '汝城县',
                            1599 => '桂东县',
                            1600 => '安仁县',
                            1601 => '资兴市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '常德市',
                        'order' => '182',
                        'child' =>
                        array(
                            1602 => '武陵区',
                            1603 => '鼎城区',
                            1604 => '安乡县',
                            1605 => '汉寿县',
                            1606 => '澧县',
                            1607 => '临澧县',
                            1608 => '桃源县',
                            1609 => '石门县',
                            1610 => '津市市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '益阳市',
                        'order' => '183',
                        'child' =>
                        array(
                            1611 => '资阳区',
                            1612 => '赫山区',
                            1613 => '南县',
                            1614 => '桃江县',
                            1615 => '安化县',
                            1616 => '沅江市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '娄底市',
                        'order' => '184',
                        'child' =>
                        array(
                            1617 => '娄星区',
                            1618 => '双峰县',
                            1619 => '新化县',
                            1620 => '冷水江市',
                            1621 => '涟源市',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '邵阳市',
                        'order' => '185',
                        'child' =>
                        array(
                            1622 => '双清区',
                            1623 => '大祥区',
                            1624 => '北塔区',
                            1625 => '邵东县',
                            1626 => '新邵县',
                            1627 => '邵阳县',
                            1628 => '隆回县',
                            1629 => '洞口县',
                            1630 => '绥宁县',
                            1631 => '新宁县',
                            1632 => '城步苗族自治县',
                            1633 => '武冈市',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '湘西土家族苗族自治州',
                        'order' => '186',
                        'child' =>
                        array(
                            1634 => '吉首市',
                            1635 => '泸溪县',
                            1636 => '凤凰县',
                            1637 => '花垣县',
                            1638 => '保靖县',
                            1639 => '古丈县',
                            1640 => '永顺县',
                            1641 => '龙山县',
                        ),
                    ),
                    11 =>
                    array(
                        'name' => '张家界市',
                        'order' => '187',
                        'child' =>
                        array(
                            1642 => '永定区',
                            1643 => '武陵源区',
                            1644 => '慈利县',
                            1645 => '桑植县',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '怀化市',
                        'order' => '188',
                        'child' =>
                        array(
                            1646 => '鹤城区',
                            1647 => '中方县',
                            1648 => '沅陵县',
                            1649 => '辰溪县',
                            1650 => '溆浦县',
                            1651 => '会同县',
                            1652 => '麻阳苗族自治县',
                            1653 => '新晃侗族自治县',
                            1654 => '芷江侗族自治县',
                            1655 => '靖州苗族侗族自治县',
                            1656 => '通道侗族自治县',
                            1657 => '洪江市',
                        ),
                    ),
                    13 =>
                    array(
                        'name' => '永州市',
                        'order' => '189',
                        'child' =>
                        array(
                            1658 => '零陵区',
                            1659 => '冷水滩区',
                            1660 => '祁阳县',
                            1661 => '东安县',
                            1662 => '双牌县',
                            1663 => '道县',
                            1664 => '江永县',
                            1665 => '宁远县',
                            1666 => '蓝山县',
                            1667 => '新田县',
                            1668 => '江华瑶族自治县',
                        ),
                    ),
                ),
            ),
            18 =>
            array(
                'name' => '广东省',
                'order' => '20',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '广州市',
                        'order' => '190',
                        'child' =>
                        array(
                            1669 => '从化市',
                            1670 => '荔湾区',
                            1671 => '越秀区',
                            1672 => '海珠区',
                            1673 => '天河区',
                            1674 => '白云区',
                            1675 => '花都区',
                            1676 => '黄埔区',
                            1677 => '萝岗区',
                            1678 => '南沙区',
                            1679 => '番禺区',
                            1680 => '增城市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '汕尾市',
                        'order' => '191',
                        'child' =>
                        array(
                            1681 => '海丰县',
                            1682 => '陆河县',
                            1683 => '陆丰市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '阳江市',
                        'order' => '192',
                        'child' =>
                        array(
                            1684 => '江城区',
                            1685 => '阳西县',
                            1686 => '阳东县',
                            1687 => '阳春市',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '揭阳市',
                        'order' => '193',
                        'child' =>
                        array(
                            1688 => '榕城区',
                            1689 => '揭东县',
                            1690 => '揭西县',
                            1691 => '惠来县',
                            1692 => '普宁市',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '茂名市',
                        'order' => '194',
                        'child' =>
                        array(
                            1693 => '茂南区',
                            1694 => '茂港区',
                            1695 => '电白县',
                            1696 => '高州市',
                            1697 => '化州市',
                            1698 => '信宜市',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '惠州市',
                        'order' => '195',
                        'child' =>
                        array(
                            1699 => '惠城区',
                            1700 => '惠阳区',
                            1701 => '博罗县',
                            1702 => '惠东县',
                            1703 => '龙门县',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '江门市',
                        'order' => '196',
                        'child' =>
                        array(
                            1704 => '蓬江区',
                            1705 => '江海区',
                            1706 => '新会区',
                            1707 => '台山市',
                            1708 => '开平市',
                            1709 => '鹤山市',
                            1710 => '恩平市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '韶关市',
                        'order' => '197',
                        'child' =>
                        array(
                            1711 => '武江区',
                            1712 => '浈江区',
                            1713 => '曲江区',
                            1714 => '始兴县',
                            1715 => '仁化县',
                            1716 => '翁源县',
                            1717 => '乳源瑶族自治县',
                            1718 => '新丰县',
                            1719 => '乐昌市',
                            1720 => '南雄市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '梅州市',
                        'order' => '198',
                        'child' =>
                        array(
                            1721 => '梅江区',
                            1722 => '梅县',
                            1723 => '大埔县',
                            1724 => '丰顺县',
                            1725 => '五华县',
                            1726 => '平远县',
                            1727 => '蕉岭县',
                            1728 => '兴宁市',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '汕头市',
                        'order' => '199',
                        'child' =>
                        array(
                            1729 => '龙湖区',
                            1730 => '金平区',
                            1731 => '濠江区',
                            1732 => '潮阳区',
                            1733 => '潮南区',
                            1734 => '澄海区',
                            1735 => '南澳县',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '深圳市',
                        'order' => '200',
                        'child' =>
                        array(
                            1736 => '罗湖区',
                            1737 => '福田区',
                            1738 => '南山区',
                            1739 => '宝安区',
                            1740 => '龙岗区',
                            1741 => '盐田区',
                        ),
                    ),
                    11 =>
                    array(
                        'name' => '珠海市',
                        'order' => '201',
                        'child' =>
                        array(
                            1742 => '香洲区',
                            1743 => '斗门区',
                            1744 => '金湾区',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '佛山市',
                        'order' => '202',
                        'child' =>
                        array(
                            1745 => '禅城区',
                            1746 => '南海区',
                            1747 => '顺德区',
                            1748 => '三水区',
                            1749 => '高明区',
                        ),
                    ),
                    13 =>
                    array(
                        'name' => '肇庆市',
                        'order' => '203',
                        'child' =>
                        array(
                            1750 => '端州区',
                            1751 => '鼎湖区',
                            1752 => '广宁县',
                            1753 => '怀集县',
                            1754 => '封开县',
                            1755 => '德庆县',
                            1756 => '高要市',
                            1757 => '四会市',
                        ),
                    ),
                    14 =>
                    array(
                        'name' => '湛江市',
                        'order' => '204',
                        'child' =>
                        array(
                            1758 => '赤坎区',
                            1759 => '霞山区',
                            1760 => '坡头区',
                            1761 => '麻章区',
                            1762 => '遂溪县',
                            1763 => '徐闻县',
                            1764 => '廉江市',
                            1765 => '雷州市',
                            1766 => '吴川市',
                        ),
                    ),
                    15 =>
                    array(
                        'name' => '中山市',
                        'order' => '205',
                    ),
                    16 =>
                    array(
                        'name' => '河源市',
                        'order' => '206',
                        'child' =>
                        array(
                            1767 => '源城区',
                            1768 => '紫金县',
                            1769 => '龙川县',
                            1770 => '连平县',
                            1771 => '和平县',
                            1772 => '东源县',
                        ),
                    ),
                    17 =>
                    array(
                        'name' => '清远市',
                        'order' => '207',
                        'child' =>
                        array(
                            1773 => '清城区',
                            1774 => '佛冈县',
                            1775 => '阳山县',
                            1776 => '连山壮族瑶族自治县',
                            1777 => '连南瑶族自治县',
                            1778 => '清新县',
                            1779 => '英德市',
                            1780 => '连州市',
                        ),
                    ),
                    18 =>
                    array(
                        'name' => '云浮市',
                        'order' => '208',
                        'child' =>
                        array(
                            1781 => '云城区',
                            1782 => '新兴县',
                            1783 => '郁南县',
                            1784 => '云安县',
                            1785 => '罗定市',
                        ),
                    ),
                    19 =>
                    array(
                        'name' => '潮州市',
                        'order' => '209',
                        'child' =>
                        array(
                            1786 => '湘桥区',
                            1787 => '潮安县',
                            1788 => '饶平县',
                        ),
                    ),
                    20 =>
                    array(
                        'name' => '东莞市',
                        'order' => '210',
                    ),
                ),
            ),
            19 =>
            array(
                'name' => '海南省',
                'order' => '24',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '海口市',
                        'order' => '255',
                        'child' =>
                        array(
                            2144 => '秀英区',
                            2145 => '龙华区',
                            2146 => '琼山区',
                            2147 => '美兰区',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '三亚市',
                        'order' => '256',
                    ),
                    2 =>
                    array(
                        'name' => '五指山市',
                        'order' => '257',
                    ),
                    3 =>
                    array(
                        'name' => '琼海市',
                        'order' => '258',
                    ),
                    4 =>
                    array(
                        'name' => '儋州市',
                        'order' => '259',
                    ),
                    5 =>
                    array(
                        'name' => '文昌市',
                        'order' => '260',
                    ),
                    6 =>
                    array(
                        'name' => '万宁市',
                        'order' => '261',
                    ),
                    7 =>
                    array(
                        'name' => '东方市',
                        'order' => '262',
                    ),
                    8 =>
                    array(
                        'name' => '澄迈县',
                        'order' => '263',
                    ),
                    9 =>
                    array(
                        'name' => '定安县',
                        'order' => '264',
                    ),
                    10 =>
                    array(
                        'name' => '屯昌县',
                        'order' => '265',
                    ),
                    11 =>
                    array(
                        'name' => '临高县',
                        'order' => '266',
                    ),
                    12 =>
                    array(
                        'name' => '白沙黎族自治县',
                        'order' => '267',
                    ),
                    13 =>
                    array(
                        'name' => '昌江黎族自治县',
                        'order' => '268',
                    ),
                    14 =>
                    array(
                        'name' => '乐东黎族自治县',
                        'order' => '269',
                    ),
                    15 =>
                    array(
                        'name' => '陵水黎族自治县',
                        'order' => '270',
                    ),
                    16 =>
                    array(
                        'name' => '保亭黎族苗族自治县',
                        'order' => '271',
                    ),
                    17 =>
                    array(
                        'name' => '琼中黎族苗族自治县',
                        'order' => '272',
                    ),
                ),
            ),
            20 =>
            array(
                'name' => '广西壮族自治区',
                'order' => '28',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '防城港市',
                        'order' => '307',
                        'child' =>
                        array(
                            2427 => '港口区',
                            2428 => '防城区',
                            2429 => '上思县',
                            2430 => '东兴市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '南宁市',
                        'order' => '308',
                        'child' =>
                        array(
                            2431 => '兴宁区',
                            2432 => '青秀区',
                            2433 => '江南区',
                            2434 => '西乡塘区',
                            2435 => '良庆区',
                            2436 => '邕宁区',
                            2437 => '武鸣县',
                            2438 => '隆安县',
                            2439 => '马山县',
                            2440 => '上林县',
                            2441 => '宾阳县',
                            2442 => '横县',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '崇左市',
                        'order' => '309',
                        'child' =>
                        array(
                            2443 => '江洲区',
                            2444 => '扶绥县',
                            2445 => '宁明县',
                            2446 => '龙州县',
                            2447 => '大新县',
                            2448 => '天等县',
                            2449 => '凭祥市',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '来宾市',
                        'order' => '310',
                        'child' =>
                        array(
                            2450 => '兴宾区',
                            2451 => '忻城县',
                            2452 => '象州县',
                            2453 => '武宣县',
                            2454 => '金秀瑶族自治县',
                            2455 => '合山市',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '柳州市',
                        'order' => '311',
                        'child' =>
                        array(
                            2456 => '城中区',
                            2457 => '鱼峰区',
                            2458 => '柳南区',
                            2459 => '柳北区',
                            2460 => '柳江县',
                            2461 => '柳城县',
                            2462 => '鹿寨县',
                            2463 => '融安县',
                            2464 => '融水苗族自治县',
                            2465 => '三江侗族自治县',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '桂林市',
                        'order' => '312',
                        'child' =>
                        array(
                            2466 => '秀峰区',
                            2467 => '叠彩区',
                            2468 => '象山区',
                            2469 => '七星区',
                            2470 => '雁山区',
                            2471 => '阳朔县',
                            2472 => '临桂县',
                            2473 => '灵川县',
                            2474 => '全州县',
                            2475 => '兴安县',
                            2476 => '永福县',
                            2477 => '灌阳县',
                            2478 => '龙胜各族自治县',
                            2479 => '资源县',
                            2480 => '平乐县',
                            2481 => '荔浦县',
                            2482 => '恭城瑶族自治县',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '梧州市',
                        'order' => '313',
                        'child' =>
                        array(
                            2483 => '万秀区',
                            2484 => '碟山区',
                            2485 => '长洲区',
                            2486 => '苍梧县',
                            2487 => '藤县',
                            2488 => '蒙山县',
                            2489 => '岑溪市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '贺州市',
                        'order' => '314',
                        'child' =>
                        array(
                            2490 => '八步区',
                            2491 => '昭平县',
                            2492 => '钟山县',
                            2493 => '富川瑶族自治县',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '贵港市',
                        'order' => '315',
                        'child' =>
                        array(
                            2494 => '港北区',
                            2495 => '港南区',
                            2496 => '覃塘区',
                            2497 => '平南县',
                            2498 => '桂平市',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '玉林市',
                        'order' => '316',
                        'child' =>
                        array(
                            2499 => '玉州区',
                            2500 => '容县',
                            2501 => '陆川县',
                            2502 => '博白县',
                            2503 => '兴业县',
                            2504 => '北流市',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '百色市',
                        'order' => '317',
                        'child' =>
                        array(
                            2505 => '右江区',
                            2506 => '田阳县',
                            2507 => '田东县',
                            2508 => '平果县',
                            2509 => '德保县',
                            2510 => '靖西县',
                            2511 => '那坡县',
                            2512 => '凌云县',
                            2513 => '乐业县',
                            2514 => '田林县',
                            2515 => '西林县',
                            2516 => '隆林各族自治县',
                        ),
                    ),
                    11 =>
                    array(
                        'name' => '钦州市',
                        'order' => '318',
                        'child' =>
                        array(
                            2517 => '钦南区',
                            2518 => '钦北区',
                            2519 => '灵山县',
                            2520 => '浦北县',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '河池市',
                        'order' => '319',
                        'child' =>
                        array(
                            2521 => '金城江区',
                            2522 => '南丹县',
                            2523 => '天峨县',
                            2524 => '凤山县',
                            2525 => '东兰县',
                            2526 => '罗城仫佬族自治县',
                            2527 => '环江毛南族自治县',
                            2528 => '巴马瑶族自治县',
                            2529 => '都安瑶族自治县',
                            2530 => '大化瑶族自治县',
                            2531 => '宜州市',
                        ),
                    ),
                    13 =>
                    array(
                        'name' => '北海市',
                        'order' => '320',
                        'child' =>
                        array(
                            2532 => '海城区',
                            2533 => '银海区',
                            2534 => '铁山港区',
                            2535 => '合浦县',
                        ),
                    ),
                ),
            ),
            21 =>
            array(
                'name' => '甘肃省',
                'order' => '21',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '兰州市',
                        'order' => '211',
                        'child' =>
                        array(
                            1789 => '城关区',
                            1790 => '七里河区',
                            1791 => '西固区',
                            1792 => '安宁区',
                            1793 => '红古区',
                            1794 => '永登县',
                            1795 => '皋兰县',
                            1796 => '榆中县',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '金昌市',
                        'order' => '212',
                        'child' =>
                        array(
                            1797 => '金川区',
                            1798 => '永昌县',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '白银市',
                        'order' => '213',
                        'child' =>
                        array(
                            1799 => '白银区',
                            1800 => '平川区',
                            1801 => '靖远县',
                            1802 => '会宁县',
                            1803 => '景泰县',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '天水市',
                        'order' => '214',
                        'child' =>
                        array(
                            1804 => '秦州区',
                            1805 => '麦积区',
                            1806 => '清水县',
                            1807 => '秦安县',
                            1808 => '甘谷县',
                            1809 => '武山县',
                            1810 => '张家川回族自治县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '嘉峪关市',
                        'order' => '215',
                    ),
                    5 =>
                    array(
                        'name' => '武威市',
                        'order' => '216',
                        'child' =>
                        array(
                            1811 => '凉州区',
                            1812 => '民勤县',
                            1813 => '古浪县',
                            1814 => '天祝藏族自治县',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '张掖市',
                        'order' => '217',
                        'child' =>
                        array(
                            1815 => '甘州区',
                            1816 => '肃南裕固族自治县',
                            1817 => '民乐县',
                            1818 => '临泽县',
                            1819 => '高台县',
                            1820 => '山丹县',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '平凉市',
                        'order' => '218',
                        'child' =>
                        array(
                            1821 => '崆峒区',
                            1822 => '泾川县',
                            1823 => '灵台县',
                            1824 => '崇信县',
                            1825 => '华亭县',
                            1826 => '庄浪县',
                            1827 => '静宁县',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '酒泉市',
                        'order' => '219',
                        'child' =>
                        array(
                            1828 => '肃州区',
                            1829 => '金塔县',
                            1830 => '瓜州县',
                            1831 => '肃北蒙古族自治县',
                            1832 => '阿克塞哈萨克族自治县',
                            1833 => '玉门市',
                            1834 => '敦煌市',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '庆阳市',
                        'order' => '220',
                        'child' =>
                        array(
                            1835 => '西峰区',
                            1836 => '庆城县',
                            1837 => '环县',
                            1838 => '华池县',
                            1839 => '合水县',
                            1840 => '正宁县',
                            1841 => '宁县',
                            1842 => '镇原县',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '定西市',
                        'order' => '221',
                        'child' =>
                        array(
                            1843 => '安定区',
                            1844 => '通渭县',
                            1845 => '陇西县',
                            1846 => '渭源县',
                            1847 => '临洮县',
                            1848 => '漳县',
                            1849 => '岷县',
                        ),
                    ),
                    11 =>
                    array(
                        'name' => '陇南市',
                        'order' => '222',
                        'child' =>
                        array(
                            1850 => '武都区',
                            1851 => '成县',
                            1852 => '文县',
                            1853 => '宕昌县',
                            1854 => '康县',
                            1855 => '西和县',
                            1856 => '礼县',
                            1857 => '徽县',
                            1858 => '两当县',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '临夏回族自治州',
                        'order' => '223',
                        'child' =>
                        array(
                            1859 => '临夏市',
                            1860 => '临夏县',
                            1861 => '康乐县',
                            1862 => '永靖县',
                            1863 => '广河县',
                            1864 => '和政县',
                            1865 => '东乡族自治县',
                            1866 => '积石山保安族东乡族撒拉族自治县',
                        ),
                    ),
                    13 =>
                    array(
                        'name' => '甘南藏族自治州',
                        'order' => '224',
                        'child' =>
                        array(
                            1867 => '合作市',
                            1868 => '临潭县',
                            1869 => '卓尼县',
                            1870 => '舟曲县',
                            1871 => '迭部县',
                            1872 => '玛曲县',
                            1873 => '碌曲县',
                            1874 => '夏河县',
                        ),
                    ),
                ),
            ),
            22 =>
            array(
                'name' => '陕西省',
                'order' => '27',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '西安市',
                        'order' => '297',
                        'child' =>
                        array(
                            2320 => '新城区',
                            2321 => '碑林区',
                            2322 => '莲湖区',
                            2323 => '灞桥区',
                            2324 => '未央区',
                            2325 => '雁塔区',
                            2326 => '阎良区',
                            2327 => '临潼区',
                            2328 => '长安区',
                            2329 => '蓝田县',
                            2330 => '周至县',
                            2331 => '户县',
                            2332 => '高陵县',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '咸阳市',
                        'order' => '298',
                        'child' =>
                        array(
                            2333 => '秦都区',
                            2334 => '杨陵区',
                            2335 => '渭城区',
                            2336 => '三原县',
                            2337 => '泾阳县',
                            2338 => '乾县',
                            2339 => '礼泉县',
                            2340 => '永寿县',
                            2341 => '彬县',
                            2342 => '长武县',
                            2343 => '旬邑县',
                            2344 => '淳化县',
                            2345 => '武功县',
                            2346 => '兴平市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '延安市',
                        'order' => '299',
                        'child' =>
                        array(
                            2347 => '宝塔区',
                            2348 => '延长县',
                            2349 => '延川县',
                            2350 => '子长县',
                            2351 => '安塞县',
                            2352 => '志丹县',
                            2353 => '吴起县',
                            2354 => '甘泉县',
                            2355 => '富县',
                            2356 => '洛川县',
                            2357 => '宜川县',
                            2358 => '黄龙县',
                            2359 => '黄陵县',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '榆林市',
                        'order' => '300',
                        'child' =>
                        array(
                            2360 => '榆阳区',
                            2361 => '神木县',
                            2362 => '府谷县',
                            2363 => '横山县',
                            2364 => '靖边县',
                            2365 => '定边县',
                            2366 => '绥德县',
                            2367 => '米脂县',
                            2368 => '佳县',
                            2369 => '吴堡县',
                            2370 => '清涧县',
                            2371 => '子洲县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '渭南市',
                        'order' => '301',
                        'child' =>
                        array(
                            2372 => '临渭区',
                            2373 => '华县',
                            2374 => '潼关县',
                            2375 => '大荔县',
                            2376 => '合阳县',
                            2377 => '澄城县',
                            2378 => '蒲城县',
                            2379 => '白水县',
                            2380 => '富平县',
                            2381 => '韩城市',
                            2382 => '华阴市',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '商洛市',
                        'order' => '302',
                        'child' =>
                        array(
                            2383 => '商州区',
                            2384 => '洛南县',
                            2385 => '丹凤县',
                            2386 => '商南县',
                            2387 => '山阳县',
                            2388 => '镇安县',
                            2389 => '柞水县',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '安康市',
                        'order' => '303',
                        'child' =>
                        array(
                            2390 => '汉滨区',
                            2391 => '汉阴县',
                            2392 => '石泉县',
                            2393 => '宁陕县',
                            2394 => '紫阳县',
                            2395 => '岚皋县',
                            2396 => '平利县',
                            2397 => '镇坪县',
                            2398 => '旬阳县',
                            2399 => '白河县',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '汉中市',
                        'order' => '304',
                        'child' =>
                        array(
                            2400 => '汉台区',
                            2401 => '南郑县',
                            2402 => '城固县',
                            2403 => '洋县',
                            2404 => '西乡县',
                            2405 => '勉县',
                            2406 => '宁强县',
                            2407 => '略阳县',
                            2408 => '镇巴县',
                            2409 => '留坝县',
                            2410 => '佛坪县',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '宝鸡市',
                        'order' => '305',
                        'child' =>
                        array(
                            2411 => '渭滨区',
                            2412 => '金台区',
                            2413 => '陈仓区',
                            2414 => '凤翔县',
                            2415 => '岐山县',
                            2416 => '扶风县',
                            2417 => '眉县',
                            2418 => '陇县',
                            2419 => '千阳县',
                            2420 => '麟游县',
                            2421 => '凤县',
                            2422 => '太白县',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '铜川市',
                        'order' => '306',
                        'child' =>
                        array(
                            2423 => '王益区',
                            2424 => '印台区',
                            2425 => '耀州区',
                            2426 => '宜君县',
                        ),
                    ),
                ),
            ),
            23 =>
            array(
                'name' => '新 疆维吾尔自治区',
                'order' => '31',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '塔城地区',
                        'order' => '333',
                        'child' =>
                        array(
                            2630 => '塔城市',
                            2631 => '乌苏市',
                            2632 => '额敏县',
                            2633 => '沙湾县',
                            2634 => '托里县',
                            2635 => '裕民县',
                            2636 => '和布克赛尔蒙古自治县',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '哈密地区',
                        'order' => '334',
                        'child' =>
                        array(
                            2637 => '哈密市',
                            2638 => '巴里坤哈萨克自治县',
                            2639 => '伊吾县',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '和田地区',
                        'order' => '335',
                        'child' =>
                        array(
                            2640 => '和田市',
                            2641 => '和田县',
                            2642 => '墨玉县',
                            2643 => '皮山县',
                            2644 => '洛浦县',
                            2645 => '策勒县',
                            2646 => '于田县',
                            2647 => '民丰县',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '阿勒泰地区',
                        'order' => '336',
                        'child' =>
                        array(
                            2648 => '阿勒泰市',
                            2649 => '布尔津县',
                            2650 => '富蕴县',
                            2651 => '福海县',
                            2652 => '哈巴河县',
                            2653 => '青河县',
                            2654 => '吉木乃县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '克孜勒苏柯尔克孜自治州',
                        'order' => '337',
                        'child' =>
                        array(
                            2655 => '阿图什市',
                            2656 => '阿克陶县',
                            2657 => '阿合奇县',
                            2658 => '乌恰县',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '博尔塔拉蒙古自治州',
                        'order' => '338',
                        'child' =>
                        array(
                            2659 => '博乐市',
                            2660 => '精河县',
                            2661 => '温泉县',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '克拉玛依市',
                        'order' => '339',
                        'child' =>
                        array(
                            2662 => '独山子区',
                            2663 => '克拉玛依区',
                            2664 => '白碱滩区',
                            2665 => '乌尔禾区',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '乌鲁木齐市',
                        'order' => '340',
                        'child' =>
                        array(
                            2666 => '天山区',
                            2667 => '沙依巴克区',
                            2668 => '新市区',
                            2669 => '水磨沟区',
                            2670 => '头屯河区',
                            2671 => '达坂城区',
                            2672 => '米东区',
                            2673 => '乌鲁木齐县',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '石河子市',
                        'order' => '341',
                    ),
                    9 =>
                    array(
                        'name' => '昌吉回族自治州',
                        'order' => '342',
                        'child' =>
                        array(
                            2674 => '昌吉市',
                            2675 => '阜康市',
                            2676 => '呼图壁县',
                            2677 => '玛纳斯县',
                            2678 => '奇台县',
                            2679 => '吉木萨尔县',
                            2680 => '木垒哈萨克自治县',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '五家渠市',
                        'order' => '343',
                    ),
                    11 =>
                    array(
                        'name' => '吐鲁番地区',
                        'order' => '344',
                        'child' =>
                        array(
                            2681 => '吐鲁番市',
                            2682 => '鄯善县',
                            2683 => '托克逊县',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '巴音郭楞蒙古自治州',
                        'order' => '345',
                        'child' =>
                        array(
                            2684 => '库尔勒市',
                            2685 => '轮台县',
                            2686 => '尉犁县',
                            2687 => '若羌县',
                            2688 => '且末县',
                            2689 => '焉耆回族自治县',
                            2690 => '和静县',
                            2691 => '和硕县',
                            2692 => '博湖县',
                        ),
                    ),
                    13 =>
                    array(
                        'name' => '阿克苏地区',
                        'order' => '346',
                        'child' =>
                        array(
                            2693 => '阿克苏市',
                            2694 => '温宿县',
                            2695 => '库车县',
                            2696 => '沙雅县',
                            2697 => '新和县',
                            2698 => '拜城县',
                            2699 => '乌什县',
                            2700 => '阿瓦提县',
                            2701 => '柯坪县',
                        ),
                    ),
                    14 =>
                    array(
                        'name' => '阿拉尔市',
                        'order' => '347',
                    ),
                    15 =>
                    array(
                        'name' => '喀什地区',
                        'order' => '348',
                        'child' =>
                        array(
                            2702 => '喀什市',
                            2703 => '疏附县',
                            2704 => '疏勒县',
                            2705 => '英吉沙县',
                            2706 => '泽普县',
                            2707 => '莎车县',
                            2708 => '叶城县',
                            2709 => '麦盖提县',
                            2710 => '岳普湖县',
                            2711 => '伽师县',
                            2712 => '巴楚县',
                            2713 => '塔什库尔干塔吉克自治县',
                        ),
                    ),
                    16 =>
                    array(
                        'name' => '图木舒克市',
                        'order' => '349',
                    ),
                    17 =>
                    array(
                        'name' => '伊犁哈萨克自治州',
                        'order' => '350',
                        'child' =>
                        array(
                            2714 => '伊宁市',
                            2715 => '奎屯市',
                            2716 => '伊宁县',
                            2717 => '察布查尔锡伯自治县',
                            2718 => '霍城县',
                            2719 => '巩留县',
                            2720 => '新源县',
                            2721 => '昭苏县',
                            2722 => '特克斯县',
                            2723 => '尼勒克县',
                        ),
                    ),
                ),
            ),
            24 =>
            array(
                'name' => '青海省',
                'order' => '26',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '海北藏族自治州',
                        'order' => '289',
                        'child' =>
                        array(
                            2277 => '门源回族自治县',
                            2278 => '祁连县',
                            2279 => '海晏县',
                            2280 => '刚察县',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '西宁市',
                        'order' => '290',
                        'child' =>
                        array(
                            2281 => '城东区',
                            2282 => '城中区',
                            2283 => '城西区',
                            2284 => '城北区',
                            2285 => '大通回族土族自治县',
                            2286 => '湟中县',
                            2287 => '湟源县',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '海东地区',
                        'order' => '291',
                        'child' =>
                        array(
                            2288 => '平安县',
                            2289 => '民和回族土族自治县',
                            2290 => '乐都县',
                            2291 => '互助土族自治县',
                            2292 => '化隆回族自治县',
                            2293 => '循化撒拉族自治县',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '黄南藏族自治州',
                        'order' => '292',
                        'child' =>
                        array(
                            2294 => '同仁县',
                            2295 => '尖扎县',
                            2296 => '泽库县',
                            2297 => '河南蒙古族自治县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '海南藏族自治州',
                        'order' => '293',
                        'child' =>
                        array(
                            2298 => '共和县',
                            2299 => '同德县',
                            2300 => '贵德县',
                            2301 => '兴海县',
                            2302 => '贵南县',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '果洛藏族自治州',
                        'order' => '294',
                        'child' =>
                        array(
                            2303 => '玛沁县',
                            2304 => '班玛县',
                            2305 => '甘德县',
                            2306 => '达日县',
                            2307 => '久治县',
                            2308 => '玛多县',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '玉树藏族自治州',
                        'order' => '295',
                        'child' =>
                        array(
                            2309 => '玉树县',
                            2310 => '杂多县',
                            2311 => '称多县',
                            2312 => '治多县',
                            2313 => '囊谦县',
                            2314 => '曲麻莱县',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '海西蒙古族藏族自治州',
                        'order' => '296',
                        'child' =>
                        array(
                            2315 => '格尔木市',
                            2316 => '德令哈市',
                            2317 => '乌兰县',
                            2318 => '都兰县',
                            2319 => '天峻县',
                        ),
                    ),
                ),
            ),
            25 =>
            array(
                'name' => '宁夏回族自治区',
                'order' => '30',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '银川市',
                        'order' => '328',
                        'child' =>
                        array(
                            2609 => '兴庆区',
                            2610 => '西夏区',
                            2611 => '金凤区',
                            2612 => '永宁县',
                            2613 => '贺兰县',
                            2614 => '灵武市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '石嘴山市',
                        'order' => '329',
                        'child' =>
                        array(
                            2615 => '大武口区',
                            2616 => '惠农区',
                            2617 => '平罗县',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '吴忠市',
                        'order' => '330',
                        'child' =>
                        array(
                            2618 => '利通区',
                            2619 => '盐池县',
                            2620 => '同心县',
                            2621 => '青铜峡市',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '固原市',
                        'order' => '331',
                        'child' =>
                        array(
                            2622 => '原州区',
                            2623 => '西吉县',
                            2624 => '隆德县',
                            2625 => '泾源县',
                            2626 => '彭阳县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '中卫市',
                        'order' => '332',
                        'child' =>
                        array(
                            2627 => '沙坡头区',
                            2628 => '中宁县',
                            2629 => '海原县',
                        ),
                    ),
                ),
            ),
            26 =>
            array(
                'name' => '重庆市',
                'order' => '4',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '重庆市',
                        'order' => '4',
                        'child' =>
                        array(
                            56 => '万州区',
                            57 => '涪陵区',
                            58 => '渝中区',
                            59 => '大渡口区',
                            60 => '江北区',
                            61 => '沙坪坝区',
                            62 => '九龙坡区',
                            63 => '南岸区',
                            64 => '北碚区',
                            65 => '万盛区',
                            66 => '双桥区',
                            67 => '渝北区',
                            68 => '巴南区',
                            69 => '黔江区',
                            70 => '长寿区',
                            71 => '江津区',
                            72 => '合川区',
                            73 => '永川区',
                            74 => '南川区',
                            75 => '綦江县',
                            76 => '潼南县',
                            77 => '铜梁县',
                            78 => '大足县',
                            79 => '荣昌县',
                            80 => '璧山县',
                            81 => '梁平县',
                            82 => '城口县',
                            83 => '丰都县',
                            84 => '垫江县',
                            85 => '武隆县',
                            86 => '忠县',
                            87 => '开县',
                            88 => '云阳县',
                            89 => '奉节县',
                            90 => '巫山县',
                            91 => '巫溪县',
                            92 => '石柱土家族自治县',
                            93 => '秀山土家族苗族自治县',
                            94 => '酉阳土家族苗族自治县',
                            95 => '彭水苗族土家族自治县',
                        ),
                    ),
                ),
            ),
            27 =>
            array(
                'name' => '四川省',
                'order' => '22',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '成都市',
                        'order' => '225',
                        'child' =>
                        array(
                            1875 => '锦江区',
                            1876 => '青羊区',
                            1877 => '金牛区',
                            1878 => '武侯区',
                            1879 => '成华区',
                            1880 => '龙泉驿区',
                            1881 => '青白江区',
                            1882 => '新都区',
                            1883 => '温江区',
                            1884 => '金堂县',
                            1885 => '双流县',
                            1886 => '郫县',
                            1887 => '大邑县',
                            1888 => '蒲江县',
                            1889 => '新津县',
                            1890 => '都江堰市',
                            1891 => '彭州市',
                            1892 => '邛崃市',
                            1893 => '崇州市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '攀枝花市',
                        'order' => '226',
                        'child' =>
                        array(
                            1894 => '东区',
                            1895 => '西区',
                            1896 => '仁和区',
                            1897 => '米易县',
                            1898 => '盐边县',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '自贡市',
                        'order' => '227',
                        'child' =>
                        array(
                            1899 => '自流井区',
                            1900 => '贡井区',
                            1901 => '大安区',
                            1902 => '沿滩区',
                            1903 => '荣县',
                            1904 => '富顺县',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '绵阳市',
                        'order' => '228',
                        'child' =>
                        array(
                            1905 => '涪城区',
                            1906 => '游仙区',
                            1907 => '三台县',
                            1908 => '盐亭县',
                            1909 => '安县',
                            1910 => '梓潼县',
                            1911 => '北川羌族自治县',
                            1912 => '平武县',
                            1913 => '江油市',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '南充市',
                        'order' => '229',
                        'child' =>
                        array(
                            1914 => '顺庆区',
                            1915 => '高坪区',
                            1916 => '嘉陵区',
                            1917 => '南部县',
                            1918 => '营山县',
                            1919 => '蓬安县',
                            1920 => '仪陇县',
                            1921 => '西充县',
                            1922 => '阆中市',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '达州市',
                        'order' => '230',
                        'child' =>
                        array(
                            1923 => '通川区',
                            1924 => '达县',
                            1925 => '宣汉县',
                            1926 => '开江县',
                            1927 => '大竹县',
                            1928 => '渠县',
                            1929 => '万源市',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '遂宁市',
                        'order' => '231',
                        'child' =>
                        array(
                            1930 => '船山区',
                            1931 => '安居区',
                            1932 => '蓬溪县',
                            1933 => '射洪县',
                            1934 => '大英县',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '广安市',
                        'order' => '232',
                        'child' =>
                        array(
                            1935 => '广安区',
                            1936 => '岳池县',
                            1937 => '武胜县',
                            1938 => '邻水县',
                            1939 => '华蓥市',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '巴中市',
                        'order' => '233',
                        'child' =>
                        array(
                            1940 => '巴州区',
                            1941 => '通江县',
                            1942 => '南江县',
                            1943 => '平昌县',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '泸州市',
                        'order' => '234',
                        'child' =>
                        array(
                            1944 => '江阳区',
                            1945 => '纳溪区',
                            1946 => '龙马潭区',
                            1947 => '泸县',
                            1948 => '合江县',
                            1949 => '叙永县',
                            1950 => '古蔺县',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '宜宾市',
                        'order' => '235',
                        'child' =>
                        array(
                            1951 => '翠屏区',
                            1952 => '宜宾县',
                            1953 => '南溪县',
                            1954 => '江安县',
                            1955 => '长宁县',
                            1956 => '高县',
                            1957 => '珙县',
                            1958 => '筠连县',
                            1959 => '兴文县',
                            1960 => '屏山县',
                        ),
                    ),
                    11 =>
                    array(
                        'name' => '资阳市',
                        'order' => '236',
                        'child' =>
                        array(
                            1961 => '雁江区',
                            1962 => '安岳县',
                            1963 => '乐至县',
                            1964 => '简阳市',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '内江市',
                        'order' => '237',
                        'child' =>
                        array(
                            1965 => '市中区',
                            1966 => '东兴区',
                            1967 => '威远县',
                            1968 => '资中县',
                            1969 => '隆昌县',
                        ),
                    ),
                    13 =>
                    array(
                        'name' => '乐山市',
                        'order' => '238',
                        'child' =>
                        array(
                            1970 => '市中区',
                            1971 => '沙湾区',
                            1972 => '五通桥区',
                            1973 => '金口河区',
                            1974 => '犍为县',
                            1975 => '井研县',
                            1976 => '夹江县',
                            1977 => '沐川县',
                            1978 => '峨边彝族自治县',
                            1979 => '马边彝族自治县',
                            1980 => '峨眉山市',
                        ),
                    ),
                    14 =>
                    array(
                        'name' => '眉山市',
                        'order' => '239',
                        'child' =>
                        array(
                            1981 => '东坡区',
                            1982 => '仁寿县',
                            1983 => '彭山县',
                            1984 => '洪雅县',
                            1985 => '丹棱县',
                            1986 => '青神县',
                        ),
                    ),
                    15 =>
                    array(
                        'name' => '凉山彝族自治州',
                        'order' => '240',
                        'child' =>
                        array(
                            1987 => '西昌市',
                            1988 => '木里藏族自治县',
                            1989 => '盐源县',
                            1990 => '德昌县',
                            1991 => '会理县',
                            1992 => '会东县',
                            1993 => '宁南县',
                            1994 => '普格县',
                            1995 => '布拖县',
                            1996 => '金阳县',
                            1997 => '昭觉县',
                            1998 => '喜德县',
                            1999 => '冕宁县',
                            2000 => '越西县',
                            2001 => '甘洛县',
                            2002 => '美姑县',
                            2003 => '雷波县',
                        ),
                    ),
                    16 =>
                    array(
                        'name' => '雅安市',
                        'order' => '241',
                        'child' =>
                        array(
                            2004 => '雨城区',
                            2005 => '名山县',
                            2006 => '荥经县',
                            2007 => '汉源县',
                            2008 => '石棉县',
                            2009 => '天全县',
                            2010 => '芦山县',
                            2011 => '宝兴县',
                        ),
                    ),
                    17 =>
                    array(
                        'name' => '甘孜藏族自治州',
                        'order' => '242',
                        'child' =>
                        array(
                            2012 => '康定县',
                            2013 => '泸定县',
                            2014 => '丹巴县',
                            2015 => '九龙县',
                            2016 => '雅江县',
                            2017 => '道孚县',
                            2018 => '炉霍县',
                            2019 => '甘孜县',
                            2020 => '新龙县',
                            2021 => '德格县',
                            2022 => '白玉县',
                            2023 => '石渠县',
                            2024 => '色达县',
                            2025 => '理塘县',
                            2026 => '巴塘县',
                            2027 => '乡城县',
                            2028 => '稻城县',
                            2029 => '得荣县',
                        ),
                    ),
                    18 =>
                    array(
                        'name' => '阿坝藏族羌族自治州',
                        'order' => '243',
                        'child' =>
                        array(
                            2030 => '汶川县',
                            2031 => '理县',
                            2032 => '茂县',
                            2033 => '松潘县',
                            2034 => '九寨沟县',
                            2035 => '金川县',
                            2036 => '小金县',
                            2037 => '黑水县',
                            2038 => '马尔康县',
                            2039 => '壤塘县',
                            2040 => '阿坝县',
                            2041 => '若尔盖县',
                            2042 => '红原县',
                        ),
                    ),
                    19 =>
                    array(
                        'name' => '德阳市',
                        'order' => '244',
                        'child' =>
                        array(
                            2043 => '旌阳区',
                            2044 => '中江县',
                            2045 => '罗江县',
                            2046 => '广汉市',
                            2047 => '什邡市',
                            2048 => '绵竹市',
                        ),
                    ),
                    20 =>
                    array(
                        'name' => '广元市',
                        'order' => '245',
                        'child' =>
                        array(
                            2049 => '市中区',
                            2050 => '元坝区',
                            2051 => '朝天区',
                            2052 => '旺苍县',
                            2053 => '青川县',
                            2054 => '剑阁县',
                            2055 => '苍溪县',
                        ),
                    ),
                ),
            ),
            28 =>
            array(
                'name' => '贵州省',
                'order' => '23',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '贵阳市',
                        'order' => '246',
                        'child' =>
                        array(
                            2056 => '南明区',
                            2057 => '云岩区',
                            2058 => '花溪区',
                            2059 => '乌当区',
                            2060 => '白云区',
                            2061 => '小河区',
                            2062 => '开阳县',
                            2063 => '息烽县',
                            2064 => '修文县',
                            2065 => '清镇市',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '遵义市',
                        'order' => '247',
                        'child' =>
                        array(
                            2066 => '红花岗区',
                            2067 => '汇川区',
                            2068 => '遵义县',
                            2069 => '桐梓县',
                            2070 => '绥阳县',
                            2071 => '正安县',
                            2072 => '道真仡佬族苗族自治县',
                            2073 => '务川仡佬族苗族自治县',
                            2074 => '凤冈县',
                            2075 => '湄潭县',
                            2076 => '余庆县',
                            2077 => '习水县',
                            2078 => '赤水市',
                            2079 => '仁怀市',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '安顺市',
                        'order' => '248',
                        'child' =>
                        array(
                            2080 => '西秀区',
                            2081 => '平坝县',
                            2082 => '普定县',
                            2083 => '镇宁布依族苗族自治县',
                            2084 => '关岭布依族苗族自治县',
                            2085 => '紫云苗族布依族自治县',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '黔南布依族苗族自治州',
                        'order' => '249',
                        'child' =>
                        array(
                            2086 => '都匀市',
                            2087 => '福泉市',
                            2088 => '荔波县',
                            2089 => '贵定县',
                            2090 => '瓮安县',
                            2091 => '独山县',
                            2092 => '平塘县',
                            2093 => '罗甸县',
                            2094 => '长顺县',
                            2095 => '龙里县',
                            2096 => '惠水县',
                            2097 => '三都水族自治县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '黔东南苗族侗族自治州',
                        'order' => '250',
                        'child' =>
                        array(
                            2098 => '凯里市',
                            2099 => '黄平县',
                            2100 => '施秉县',
                            2101 => '三穗县',
                            2102 => '镇远县',
                            2103 => '岑巩县',
                            2104 => '天柱县',
                            2105 => '锦屏县',
                            2106 => '剑河县',
                            2107 => '台江县',
                            2108 => '黎平县',
                            2109 => '榕江县',
                            2110 => '从江县',
                            2111 => '雷山县',
                            2112 => '麻江县',
                            2113 => '丹寨县',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '铜仁地区',
                        'order' => '251',
                        'child' =>
                        array(
                            2114 => '铜仁市',
                            2115 => '江口县',
                            2116 => '玉屏侗族自治县',
                            2117 => '石阡县',
                            2118 => '思南县',
                            2119 => '印江土家族苗族自治县',
                            2120 => '德江县',
                            2121 => '沿河土家族自治县',
                            2122 => '松桃苗族自治县',
                            2123 => '万山特区',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '毕节地区',
                        'order' => '252',
                        'child' =>
                        array(
                            2124 => '毕节市',
                            2125 => '大方县',
                            2126 => '黔西县',
                            2127 => '金沙县',
                            2128 => '织金县',
                            2129 => '纳雍县',
                            2130 => '威宁彝族回族苗族自治县',
                            2131 => '赫章县',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '六盘水市',
                        'order' => '253',
                        'child' =>
                        array(
                            2132 => '钟山区',
                            2133 => '六枝特区',
                            2134 => '水城县',
                            2135 => '盘县',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '黔西南布依族苗族自治州',
                        'order' => '254',
                        'child' =>
                        array(
                            2136 => '兴义市',
                            2137 => '兴仁县',
                            2138 => '普安县',
                            2139 => '晴隆县',
                            2140 => '贞丰县',
                            2141 => '望谟县',
                            2142 => '册亨县',
                            2143 => '安龙县',
                        ),
                    ),
                ),
            ),
            29 =>
            array(
                'name' => '云南省',
                'order' => '25',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '西双版纳傣族自治州',
                        'order' => '273',
                        'child' =>
                        array(
                            2148 => '景洪市',
                            2149 => '勐海县',
                            2150 => '勐腊县',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '德宏傣族景颇族自治州',
                        'order' => '274',
                        'child' =>
                        array(
                            2151 => '瑞丽市',
                            2152 => '潞西市',
                            2153 => '梁河县',
                            2154 => '盈江县',
                            2155 => '陇川县',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '昭通市',
                        'order' => '275',
                        'child' =>
                        array(
                            2156 => '昭阳区',
                            2157 => '鲁甸县',
                            2158 => '巧家县',
                            2159 => '盐津县',
                            2160 => '大关县',
                            2161 => '永善县',
                            2162 => '绥江县',
                            2163 => '镇雄县',
                            2164 => '彝良县',
                            2165 => '威信县',
                            2166 => '水富县',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '昆明市',
                        'order' => '276',
                        'child' =>
                        array(
                            2167 => '五华区',
                            2168 => '盘龙区',
                            2169 => '官渡区',
                            2170 => '西山区',
                            2171 => '东川区',
                            2172 => '呈贡县',
                            2173 => '晋宁县',
                            2174 => '富民县',
                            2175 => '宜良县',
                            2176 => '石林彝族自治县',
                            2177 => '嵩明县',
                            2178 => '禄劝彝族苗族自治县',
                            2179 => '寻甸回族彝族自治县',
                            2180 => '安宁市',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '大理白族自治州',
                        'order' => '277',
                        'child' =>
                        array(
                            2181 => '大理市',
                            2182 => '漾濞彝族自治县',
                            2183 => '祥云县',
                            2184 => '宾川县',
                            2185 => '弥渡县',
                            2186 => '南涧彝族自治县',
                            2187 => '巍山彝族回族自治县',
                            2188 => '永平县',
                            2189 => '云龙县',
                            2190 => '洱源县',
                            2191 => '剑川县',
                            2192 => '鹤庆县',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '红河哈尼族彝族自治州',
                        'order' => '278',
                        'child' =>
                        array(
                            2193 => '个旧市',
                            2194 => '开远市',
                            2195 => '蒙自县',
                            2196 => '屏边苗族自治县',
                            2197 => '建水县',
                            2198 => '石屏县',
                            2199 => '弥勒县',
                            2200 => '泸西县',
                            2201 => '元阳县',
                            2202 => '红河县',
                            2203 => '金平苗族瑶族傣族自治县',
                            2204 => '绿春县',
                            2205 => '河口瑶族自治县',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '曲靖市',
                        'order' => '279',
                        'child' =>
                        array(
                            2206 => '麒麟区',
                            2207 => '马龙县',
                            2208 => '陆良县',
                            2209 => '师宗县',
                            2210 => '罗平县',
                            2211 => '富源县',
                            2212 => '会泽县',
                            2213 => '沾益县',
                            2214 => '宣威市',
                        ),
                    ),
                    7 =>
                    array(
                        'name' => '保山市',
                        'order' => '280',
                        'child' =>
                        array(
                            2215 => '隆阳区',
                            2216 => '施甸县',
                            2217 => '腾冲县',
                            2218 => '龙陵县',
                            2219 => '昌宁县',
                        ),
                    ),
                    8 =>
                    array(
                        'name' => '文山壮族苗族自治州',
                        'order' => '281',
                        'child' =>
                        array(
                            2220 => '文山县',
                            2221 => '砚山县',
                            2222 => '西畴县',
                            2223 => '麻栗坡县',
                            2224 => '马关县',
                            2225 => '丘北县',
                            2226 => '广南县',
                            2227 => '富宁县',
                        ),
                    ),
                    9 =>
                    array(
                        'name' => '玉溪市',
                        'order' => '282',
                        'child' =>
                        array(
                            2228 => '红塔区',
                            2229 => '江川县',
                            2230 => '澄江县',
                            2231 => '通海县',
                            2232 => '华宁县',
                            2233 => '易门县',
                            2234 => '峨山彝族自治县',
                            2235 => '新平彝族傣族自治县',
                            2236 => '元江哈尼族彝族傣族自治县',
                        ),
                    ),
                    10 =>
                    array(
                        'name' => '楚雄彝族自治州',
                        'order' => '283',
                        'child' =>
                        array(
                            2237 => '楚雄市',
                            2238 => '双柏县',
                            2239 => '牟定县',
                            2240 => '南华县',
                            2241 => '姚安县',
                            2242 => '大姚县',
                            2243 => '永仁县',
                            2244 => '元谋县',
                            2245 => '武定县',
                            2246 => '禄丰县',
                        ),
                    ),
                    11 =>
                    array(
                        'name' => '普洱市',
                        'order' => '284',
                        'child' =>
                        array(
                            2247 => '思茅区',
                            2248 => '宁洱哈尼族彝族自治县',
                            2249 => '墨江哈尼族自治县',
                            2250 => '景东彝族自治县',
                            2251 => '景谷傣族彝族自治县',
                            2252 => '镇沅彝族哈尼族拉祜族自治县',
                            2253 => '江城哈尼族彝族自治县',
                            2254 => '孟连傣族拉祜族佤族自治县',
                            2255 => '澜沧拉祜族自治县',
                            2256 => '西盟佤族自治县',
                        ),
                    ),
                    12 =>
                    array(
                        'name' => '临沧市',
                        'order' => '285',
                        'child' =>
                        array(
                            2257 => '临翔区',
                            2258 => '凤庆县',
                            2259 => '云县',
                            2260 => '永德县',
                            2261 => '镇康县',
                            2262 => '双江拉祜族佤族布朗族傣族自治县',
                            2263 => '耿马傣族佤族自治县',
                            2264 => '沧源佤族自治县',
                        ),
                    ),
                    13 =>
                    array(
                        'name' => '怒江傈傈族自治州',
                        'order' => '286',
                        'child' =>
                        array(
                            2265 => '泸水县',
                            2266 => '福贡县',
                            2267 => '贡山独龙族怒族自治县',
                            2268 => '兰坪白族普米族自治县',
                        ),
                    ),
                    14 =>
                    array(
                        'name' => '迪庆藏族自治州',
                        'order' => '287',
                        'child' =>
                        array(
                            2269 => '香格里拉县',
                            2270 => '德钦县',
                            2271 => '维西傈僳族自治县',
                        ),
                    ),
                    15 =>
                    array(
                        'name' => '丽江市',
                        'order' => '288',
                        'child' =>
                        array(
                            2272 => '古城区',
                            2273 => '玉龙纳西族自治县',
                            2274 => '永胜县',
                            2275 => '华坪县',
                            2276 => '宁蒗彝族自治县',
                        ),
                    ),
                ),
            ),
            30 =>
            array(
                'name' => '西藏自治区',
                'order' => '29',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '拉萨市',
                        'order' => '321',
                        'child' =>
                        array(
                            2536 => '城关区',
                            2537 => '林周县',
                            2538 => '当雄县',
                            2539 => '尼木县',
                            2540 => '曲水县',
                            2541 => '堆龙德庆县',
                            2542 => '达孜县',
                            2543 => '墨竹工卡县',
                        ),
                    ),
                    1 =>
                    array(
                        'name' => '日喀则地区',
                        'order' => '322',
                        'child' =>
                        array(
                            2544 => '日喀则市',
                            2545 => '南木林县',
                            2546 => '江孜县',
                            2547 => '定日县',
                            2548 => '萨迦县',
                            2549 => '拉孜县',
                            2550 => '昂仁县',
                            2551 => '谢通门县',
                            2552 => '白朗县',
                            2553 => '仁布县',
                            2554 => '康马县',
                            2555 => '定结县',
                            2556 => '仲巴县',
                            2557 => '亚东县',
                            2558 => '吉隆县',
                            2559 => '聂拉木县',
                            2560 => '萨嘎县',
                            2561 => '岗巴县',
                        ),
                    ),
                    2 =>
                    array(
                        'name' => '山南地区',
                        'order' => '323',
                        'child' =>
                        array(
                            2562 => '乃东县',
                            2563 => '扎囊县',
                            2564 => '贡嘎县',
                            2565 => '桑日县',
                            2566 => '琼结县',
                            2567 => '曲松县',
                            2568 => '措美县',
                            2569 => '洛扎县',
                            2570 => '加查县',
                            2571 => '隆子县',
                            2572 => '错那县',
                            2573 => '浪卡子县',
                        ),
                    ),
                    3 =>
                    array(
                        'name' => '林芝地区',
                        'order' => '324',
                        'child' =>
                        array(
                            2574 => '林芝县',
                            2575 => '工布江达县',
                            2576 => '米林县',
                            2577 => '墨脱县',
                            2578 => '波密县',
                            2579 => '察隅县',
                            2580 => '朗县',
                        ),
                    ),
                    4 =>
                    array(
                        'name' => '昌都地区',
                        'order' => '325',
                        'child' =>
                        array(
                            2581 => '昌都县',
                            2582 => '江达县',
                            2583 => '贡觉县',
                            2584 => '类乌齐县',
                            2585 => '丁青县',
                            2586 => '察雅县',
                            2587 => '八宿县',
                            2588 => '左贡县',
                            2589 => '芒康县',
                            2590 => '洛隆县',
                            2591 => '边坝县',
                        ),
                    ),
                    5 =>
                    array(
                        'name' => '那曲地区',
                        'order' => '326',
                        'child' =>
                        array(
                            2592 => '那曲县',
                            2593 => '嘉黎县',
                            2594 => '比如县',
                            2595 => '聂荣县',
                            2596 => '安多县',
                            2597 => '申扎县',
                            2598 => '索县',
                            2599 => '班戈县',
                            2600 => '巴青县',
                            2601 => '尼玛县',
                        ),
                    ),
                    6 =>
                    array(
                        'name' => '阿里地区',
                        'order' => '327',
                        'child' =>
                        array(
                            2602 => '普兰县',
                            2603 => '札达县',
                            2604 => '噶尔县',
                            2605 => '日土县',
                            2606 => '革吉县',
                            2607 => '改则县',
                            2608 => '措勤县',
                        ),
                    ),
                ),
            ),
            31 =>
            array(
                'name' => '台湾省',
                'order' => '7',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '台北市',
                        'order' => '363',
                    ),
                    1 =>
                    array(
                        'name' => '高雄市',
                        'order' => '364',
                    ),
                    2 =>
                    array(
                        'name' => '基隆市',
                        'order' => '365',
                    ),
                    3 =>
                    array(
                        'name' => '台中市',
                        'order' => '366',
                    ),
                    4 =>
                    array(
                        'name' => '台南市',
                        'order' => '367',
                    ),
                    5 =>
                    array(
                        'name' => '新竹市',
                        'order' => '368',
                    ),
                    6 =>
                    array(
                        'name' => '嘉义市',
                        'order' => '369',
                    ),
                ),
            ),
            32 =>
            array(
                'name' => '澳门特别行政区',
                'order' => '33',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '澳门特别行政区',
                        'order' => '370',
                    ),
                ),
            ),
            33 =>
            array(
                'name' => '香港特别行政区',
                'order' => '34',
                'child' =>
                array(
                    0 =>
                    array(
                        'name' => '香港特别行政区',
                        'order' => '371',
                    ),
                ),
            ),
        );
    }

    public function saveData() {
        
    }

}

